{"url": "https://indeedinspiring.com/dashboard/", "section_title": "IndeedInspiring", "description": "form { } Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups R", "text": "IndeedInspiring form { } Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Login / Register Email* SEND OTP Trouble logging in? reach out to us at prushaltech@gmail.com Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/From%20Learning%20to%20Earning:%20Azure%20Data%20Engineering%20Career%20Guide", "section_title": "IndeedInspiring", "description": "On Wednesday, 2 April, 2025, from 11 a.m. Event has passed 🔹 Session Overview: Join us for an insightful session designed to guide you through the journey of becoming an Azure Data Engineer. This informative talk will cover the essential steps, skills, and certifications needed to transition from learning to a successful career in Azure data engineering. Understanding the Role: Learn about the responsibilities and impact of an Azure Data Engineer in today's data-driven landscape. Skill Developme", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal From Learning to Earning: Azure Data Engineering Career Guide On Wednesday, 2 April, 2025, from 11 a.m. Event has passed From Learning to Earning: Azure Data Engineering Career Guide 🔹 Session Overview: Join us for an insightful session designed to guide you through the journey of becoming an Azure Data Engineer. This informative talk will cover the essential steps, skills, and certifications needed to transition from learning to a successful career in Azure data engineering. 🔹 What You’ll Gain: Understanding the Role: Learn about the responsibilities and impact of an Azure Data Engineer in today's data-driven landscape.​ Skill Development: Discover the key technical and soft skills required, including proficiency in SQL, data modeling, programming languages like Python, and familiarity with Azure data services such as Azure Data Factory and Azure Databricks.​ Certification Insights: Get an overview of Azure Data Engineer Associate certification, including preparation tips and benefits. Career Pathways: Explore potential career trajectories, industry demand, and opportunities for advancement in the field of data engineering.​ 🔹 Why Attend? Expert Guidance: Gain valuable insights from experienced professionals in the Azure data engineering domain.​ Comprehensive Overview: Equip yourself with the knowledge to navigate your career path effectively.​ Interactive Q&A: Engage with speakers to clarify doubts and receive personalized advice. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways: Learn & Stay Updated: Gain insights into the latest trends and technologies in Azure Data Engineering, including data integration, big data processing, and cloud-based analytics. Stay ahead in this dynamic field.​ Certification & Career Advancement: Understand the significance of certifications and learn how they can enhance your professional credibility and open doors to new opportunities.​ Enhance Problem-Solving Skills: Discover strategies to improve your analytical thinking and problem-solving abilities, crucial for designing efficient data solutions and overcoming real-world challenges in data engineering. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Full%20Stack%20MERN", "section_title": "IndeedInspiring", "description": "On Thursday, 10 April, 2025, from 10 a.m. Event has passed Conceptual Overview: Explore the core components of the MERN stack and their integration in building dynamic web applications. Project Implementation: Learn about structuring and managing MERN stack projects for scalability and maintainability. Best Practices: Gain insights into effective development workflows and common pitfalls to avoid in MERN stack development. Comprehensive Understanding: Acquire knowledge of full-stack development", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Full Stack MERN On Thursday, 10 April, 2025, from 10 a.m. Event has passed Full Stack MERN 🔹 How It Works: Conceptual Overview: Explore the core components of the MERN stack and their integration in building dynamic web applications.​ Project Implementation: Learn about structuring and managing MERN stack projects for scalability and maintainability.​ Best Practices: Gain insights into effective development workflows and common pitfalls to avoid in MERN stack development. 🔹 Why Participate? Comprehensive Understanding: Acquire knowledge of full-stack development using a unified JavaScript framework.​ Industry Relevance: Understand the growing importance of the MERN stack in the tech industry and how it facilitates efficient development workflows.​ Skill Enhancement: Enhance your ability to develop robust, scalable, and efficient web applications using the MERN stack. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways: Comprehensive Understanding: Explore the components of the MERN stack and their integration to build robust web applications. ​ Strategic Implementation: Learn best practices for structuring and managing MERN stack projects to ensure scalability and maintainability. ​ Industry Relevance: Understand the growing importance of full-stack JavaScript development in the tech industry and how MERN facilitates efficient development workflows. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/colabs/", "section_title": "IndeedInspiring", "description": "The key decision makers in India’s leading enterprises agree that “un-employability” is a bigger problem than unemployment. What does the industry need ?? Let us together BRIDGE this GAP. With a proven step by step process of Up-skilling → Mentorship → Internship → Job", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Industry-Academia Collaboration The key decision makers in India’s leading enterprises agree that “un-employability” is a bigger problem than unemployment. What does the industry need ?? Candidate who innovate solutions for problems Candidates who are adaptive with the change Candidates with sound technical knowledge Candidates who are great at interpersonal skills Let us together BRIDGE this GAP. With a proven step by step process of Up-skilling → Mentorship → Internship → Job Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/contactus/", "section_title": "IndeedInspiring", "description": "Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Bui", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Contact Us Send message Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/college_university_services/", "section_title": "IndeedInspiring", "description": "Indeed Inspiring Infotech unites with colleges and universities to support their students and faculties with bridging the gap between industry demand and academics. We ensure this with our innovative training solutions that are delivered just-in-time and are designed to perfectly suit and appropriately fill the requirements needs and gaps. As each technology investment requires an investment in tools and people, the college and university clients turn to Indeed Inspiring Infotech for their conti", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal College University Services Indeed Inspiring Infotech unites with colleges and universities to support their students and faculties with bridging the gap between industry demand and academics. We ensure this with our innovative training solutions that are delivered just-in-time and are designed to perfectly suit and appropriately fill the requirements needs and gaps. As each technology investment requires an investment in tools and people, the college and university clients turn to Indeed Inspiring Infotech for their continual training requirements and potential needs. Participant’s profile – Fresher: Graduate or postgraduate, Computer Science Major or otherwise Typical Duration- 30 to 45 days [8 hrs per day] Expected outcomes ● Sound fundamentals of programming/testing/System Administration ● Knowledge of basic set of tools and languages ● Knowledge of applying technology to solve a problem based on case studies ● Course Contents- Generally designed by the joint team of Subject Matter Expert (SME) from Indeed Inspiring Infotech and the Client in accordance with job roles/projects. List of courses ● Following are the modules covered as part of this type of training. All of these modules can be customized to the extent desired in the context of project requirements. ● Fundamentals- Python programming, SQL, DBMS concepts, Unix basics ● Data Science, Artificial Intelligence and Machine Learning ● Data Engineering, Data Warehousing, ETL, Big Data ● Business Analytics, Tableau, PowerBI Advantage Our training results are – enhanced knowledge, efficiency and productivity. We bring the best training convenience and results with: ● Customization options – Modifying existing courses, blending delivery methods, custom-designing courseware, coaching and mentoring on technologies and tools, consulting for new technology assimilation to address client-specific situation and challenges ● Flexible approach – Classroom based Client site offerings and Online VC based offerings ● Wide range of offerings – Information Technology, Project Management, Management development programs ● Quality instructors – Certified technical instructors, with real-world experience working in multi-technology, multi-vendor, multi-network environments ● Comprehensive Course/ study material – Easy to understand and comprehend study material and practical assignments. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/MOUs/", "section_title": "Server Error (500)", "description": "No meaningful description available.", "text": "Server Error (500) Server Error (500)"}
{"url": "https://indeedinspiring.com/event_page/Investment%20Trends%20in%20AI%20and%20Data%20Startups", "section_title": "IndeedInspiring", "description": "On Tuesday, 8 April, 2025, from 10 a.m. Event has passed Learn & Stay Updated: Gain insights into current and future investment patterns, what excites VCs and angel investors in the AI space, and how data-driven startups are securing funding in a competitive market. Certification: All participants will receive a certificate of completion, recognizing your initiative in understanding the investment ecosystem in emerging technologies. Improve Problem-Solving Skills: Enhance your entrepreneurial th", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Investment Trends in AI and Data Startups On Tuesday, 8 April, 2025, from 10 a.m. Event has passed Investing in the Future: AI & Data Startups A panel discussion on emerging investment trends shaping the future of AI and data-driven startups. How It Works: Expert Panel: Hear from leading investors, founders, and innovators in the AI and startup ecosystem. Trend Analysis: Explore current and upcoming shifts in funding, innovation, and startup scaling. Interactive Q&A: Engage with panelists through questions, discussions, and insights. Why Participate? Gain a deeper understanding of what drives investment in AI and data-centric ventures. Learn what investors look for in early-stage startups and scalable tech solutions. Stay informed about the financial and technological forces shaping the startup landscape. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways Learn & Stay Updated: Gain insights into current and future investment patterns, what excites VCs and angel investors in the AI space, and how data-driven startups are securing funding in a competitive market. Certification: All participants will receive a certificate of completion, recognizing your initiative in understanding the investment ecosystem in emerging technologies. Improve Problem-Solving Skills: Enhance your entrepreneurial thinking by learning how successful startups pitch ideas, adapt to market trends, and align with investor expectations in the AI domain. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Personality%20Development%20and%20Interview%20Skills", "section_title": "IndeedInspiring", "description": "On Saturday, 5 April, 2025, from 11 a.m. Event has passed Enhance your personal and professional growth by mastering effective communication and interview techniques essential for career success. Expert-Led Workshops: Engage in sessions conducted by experienced trainers focusing on key aspects of personality development and interview preparation. Comprehensive Coverage: Topics include communication skills, personal grooming, and strategies to tackle challenging interview questions. Interactive L", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Personality Development and Interview Skills On Saturday, 5 April, 2025, from 11 a.m. Event has passed Personality Development and Interview Skills Session Enhance your personal and professional growth by mastering effective communication and interview techniques essential for career success.​ 🔹 How It Works: Expert-Led Workshops: Engage in sessions conducted by experienced trainers focusing on key aspects of personality development and interview preparation.​ Comprehensive Coverage: Topics include communication skills, personal grooming, and strategies to tackle challenging interview questions. ​ Interactive Learning: Participate in role-plays, simulations, and group activities designed to build confidence and practical skills.​ 🔹 Why Participate? Boost Employability: Acquire the skills and confidence to excel in interviews and make a positive impression on potential employers.​ Personal Growth: Develop self-awareness and improve interpersonal skills that are valuable in both professional and personal settings.​ Certification: Receive a certificate of completion, demonstrating your commitment to personal development and readiness for the job market. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways: Learn & Stay Updated: Gain insights into the latest strategies for personality development, including effective communication, and adaptability, to stay ahead in your career. ​ Certification: All participants will receive a certificate of completion, demonstrating their commitment to personal growth and professional development.​ Improve Problem-Solving Skills: Enhance your ability to navigate challenging interview scenarios and interpersonal interactions, thereby boosting your confidence and employability. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Mastering%20Deep%20Learning%20with%20TensorFlow%20and%20Keras", "section_title": "IndeedInspiring", "description": "On Wednesday, 28 February, 2024, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Take your understanding of image processing to the next level. Gain an edge in the rapidly growing field of deep learning. Interact with our experts and get your queries answered. This workshop promises to be an enriching learning experience, making it a must-attend for students and faculty eager to stay ahead in the realms of deep learning. Grasp the core concepts and potential of this transf", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Mastering Deep Learning with TensorFlow and Keras On Wednesday, 28 February, 2024, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Enhance your skills Take your understanding of image processing to the next level. Explore career opportunities Gain an edge in the rapidly growing field of deep learning. Ask your questions Interact with our experts and get your queries answered. Skills of Tomorrow This workshop promises to be an enriching learning experience, making it a must-attend for students and faculty eager to stay ahead in the realms of deep learning. REGISTRATION CLOSED What you'll learn Deep Learning Fundamentals Grasp the core concepts and potential of this transformative technology. TensorFlow & Keras Dive into these popular tools for building and training deep learning models. Neural Networks & CNNs Understand the building blocks of image processing with deep learning. Image Classification, Detection & Segmentation Master key techniques for extracting insights from images. Transfer Learning & GANs Leverage pre-trained models and explore cutting-edge image generation methods. Practical Tips & Real-World Applications Gain valuable insights and discover the diverse ways deep learning is used in image processing. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Mapping%20the%20Brain%20with%20AI", "section_title": "IndeedInspiring", "description": "On Saturday, 12 April, 2025, from 3 p.m. Event has passed Explore how AI is unlocking the mysteries of the human brain through advanced neural mapping and data analysis. Learn & Stay Updated: Dive into the intersection of neuroscience and artificial intelligence. Learn how AI is being used to decode brain signals, build neural maps, and push the boundaries of cognitive research and healthcare innovation. Certification: All participants will receive a certificate of completion, recognizing your c", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Mapping the Brain with AI On Saturday, 12 April, 2025, from 3 p.m. Event has passed Mapping the Brain with AI Explore how AI is unlocking the mysteries of the human brain through advanced neural mapping and data analysis. How It Works: Visual Insights: Discover how AI interprets brain signals and visualizes neural activity. Simplified Concepts: Complex neuroscience and AI technologies made easy to grasp. Interactive Format: Join thought-provoking discussions, ask questions, and share perspectives. Why Participate? Gain a deeper understanding of how artificial intelligence is accelerating breakthroughs in neuroscience. Learn about real-world applications in mental health, neurotechnology, and brain-computer interfaces. Stay at the forefront of AI innovation intersecting with cognitive science and human intelligence. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways Learn & Stay Updated: Dive into the intersection of neuroscience and artificial intelligence. Learn how AI is being used to decode brain signals, build neural maps, and push the boundaries of cognitive research and healthcare innovation. Certification: All participants will receive a certificate of completion, recognizing your curiosity and effort in exploring the future of neuro-AI technologies. Improve Problem-Solving Skills: Enhance your analytical thinking by understanding how real-time brain data is modeled and interpreted using machine learning and deep neural networks. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/courses/general-aptitude-training/", "section_title": "IndeedInspiring", "description": "General Aptitude Syllabus NUMERICAL ABILITY - Number systems - Percentages - Ratio and proportion - Percentages - Time, speed, and distance - Profit and loss - Data interpretation (charts, graphs, tables) - Simple and compound interest - Permutations and combinations - Probability VERBAL ABILITY - Vocabulary - Synonyms and antonyms - Analogies - Sentence completion - Sentence correction - Grammar and usage - Idioms and phrases - Reading comprehension LOGICAL REASONING - Pattern recognition - Ser", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal General Aptitude Syllabus NUMERICAL ABILITY Number systems Percentages Ratio and proportion Percentages Time, speed, and distance Profit and loss Data interpretation (charts, graphs, tables) Simple and compound interest Permutations and combinations Probability VERBAL ABILITY Vocabulary Synonyms and antonyms Analogies Sentence completion Sentence correction Grammar and usage Idioms and phrases Reading comprehension LOGICAL REASONING Pattern recognition Series completion Coding and decoding Blood relations Syllogisms Logical puzzles Data sufficiency Logical deductions ANALYTICAL ABILITY Critical Reasoning Deductive and inductive reasoning Analytical Puzzles Data interpretation (charts, graphs, tables) Decision-making SPATIAL ABILITY Visualization and spatial orientation Rotating and folding shapes Pattern recognition in 2D and 3D figures Mental aptitude for spatial manipulation Download Brochure Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/courses/project-based-training/", "section_title": "IndeedInspiring", "description": "Project Based Training Program Overview We are delighted to present this proposal for a project-based training program aimed at developing problem solving skills and fostering creativity within the Organization. The training will focus on a hands-on approach, providing participants with practical experience and the ability to implement innovative solutions. Our objective is to equip your team with the necessary skills to identify problems, evaluate multiple solutions, design prototypes, and comm", "text": "IndeedInspiring .new-program{ background } Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Project Based Training Program Overview We are delighted to present this proposal for a project-based training program aimed at developing problem solving skills and fostering creativity within the Organization. The training will focus on a hands-on approach, providing participants with practical experience and the ability to implement innovative solutions. Our objective is to equip your team with the necessary skills to identify problems, evaluate multiple solutions, design prototypes, and communicate their findings effectively. Training Objectives FORMULATE A PROBLEM STATEMENT IDENTIFY POSSIBLE SET OF SOLUTIONS ENLIST PROS AND CONS OF ALL THE SOLUTIONS CHOOSE BEST AND OPTIMAL SOLUTION USE PROPS AND TOOLS TO DESIGN THE SOLUTION EXPECTED OUTCOME To measure the success and effectiveness of the training, we propose the following outputs from the participants: The first output should be a physical model created using props, showcasing their solution design. The second output should be a web-based or website prototype using platforms like Google Sites, Blogspot, or WordPress, presenting their solution concept digitally. The third output should be a video report documenting the entire project journey and its findings, which will be published on LinkedIn to promote the participants' achievements. Download Brochure Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/payments/", "section_title": "IndeedInspiring", "description": "Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Bui", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Pick a Payment method that Works for You! UPI Scan Works best for Mobile Payment Users PAY Account Transfer Transfer directly to the Account PAY Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/about/", "section_title": "IndeedInspiring", "description": "Established in 2015, we design and deliver quality training solutions to enhance team potential and develop new skills. Our rapidly growing client base spans a wide range of industries and includes SMEs and multinational corporations. Indeed Inspiring Infotech was founded with a value system focused on training and internship programs on academics as well as corporate level. We are rapidly expanding our service offering catering to the unique needs of our clientele. We resource Corporate Trainer", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal About Us Established in 2015, we design and deliver quality training solutions to enhance team potential and develop new skills. Our rapidly growing client base spans a wide range of industries and includes SMEs and multinational corporations. Indeed Inspiring Infotech was founded with a value system focused on training and internship programs on academics as well as corporate level. We are rapidly expanding our service offering catering to the unique needs of our clientele. We are Passionate About Learn and Develop Model We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Our Mission Our Team is on a charge to deliver on the upcoming demands of the IT Industry on the levels of Technical Skills. We are currently catering the Services regarding Trainers & Trainings requirements. Our Vision We believe, Education with L&D model help us to not only make careers but moreover make Future minds for the country. We look forward to impart Skills to all the budding Minds of the nation. Our Values Indeed Inspiring infotech was founded with a value system focused on training and internship programs on academics as well as on corporate level. Our breathe of services span across IT training and solutions. Education is in Our Blood Explore the skills and choose your suitable one. VIEW ALL COURSES Our Awesome Team Kushal Sharma Founder, Indeed Inspiring Infotech Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/events/coding-for-kids/", "section_title": "IndeedInspiring", "description": "Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Bui", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Coding For Kids Program Brochure Age - 5 to 8 Years Curriculm Age - 9 to 14 Years Curriculm REGISTER HERE Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Ideathon%202025%20%E2%80%93%20Innovate,%20Pitch%20&%20Impact!", "section_title": "IndeedInspiring", "description": "On Thursday, 10 April, 2025, from 11 a.m. Event has passed The Ideathon at DataFest 2025 is a platform for students, professionals, and entrepreneurs to identify industry challenges and develop tech-driven innovative solutions. Participants will learn business model canvas techniques, pitching strategies, and gain direct mentorship from experts while solving real-world problems. ✅ Identifying Industry Challenges – Understand key pain points across industries. ✅ Business Model Canvas & Pitching T", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Ideathon 2025 – Innovate, Pitch & Impact! On Thursday, 10 April, 2025, from 11 a.m. Event has passed Event Description: The Ideathon at DataFest 2025 is a platform for students, professionals, and entrepreneurs to identify industry challenges and develop tech-driven innovative solutions. Participants will learn business model canvas techniques, pitching strategies, and gain direct mentorship from experts while solving real-world problems. Contents Covered: ✅ Identifying Industry Challenges – Understand key pain points across industries. ✅ Business Model Canvas & Pitching Techniques – Learn to structure and present ideas effectively. ✅ AI, Data & Tech-Driven Innovation – Leverage cutting-edge technology for impactful solutions. ✅ Presenting Ideas to Industry Experts – Receive feedback from professionals and investors. Who Can Participate? Open to all domains – tech enthusiasts, business strategists, healthcare professionals, and creative thinkers. Ideal for those passionate about startups, AI-driven innovation, and business problem-solving. Benefits & Certifications: 🏆 Prize: ₹1,000 Cash Prize + Trophy + Certificate 📜 Certificates for All Participants 🎯 Direct Mentorship from Industry Experts 🚀 Special Recognition for Winners Key Takeaways: 🔹 Solve Real-World Problems – Develop AI-powered and business-driven solutions. 🔹 Learn Business Models & Pitching – Master investor-ready presentations. 🔹 Receive Direct Mentorship – Guidance from industry professionals. 🔹 Boost Your Career – Stand out in the startup and innovation ecosystem. 📢 Register now and be a part of the innovation revolution at DataFest 2025! 🚀 Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Join the Ideathon at DataFest 2025 and turn your innovative ideas into impactful solutions! 🚀 Gain mentorship, showcase your creativity, and compete for prizes. Register now and be a part of the future of innovation! Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/SQL%20Fundamentals%20Workshop", "section_title": "IndeedInspiring", "description": "On Monday, 25 September, 2023, from 8:30 p.m. Event has passed [Recorded] click here to Watch on Youtube Unlock the power of data with our SQL Fundamentals Workshop! Join us on September 25, 2023, from 8:30 PM to 9:30 PM and dive into the world of structured data querying. Whether you're a beginner or a pro, this workshop will enhance your skills and boost your career. Are you looking to enhance your data management skills and unlock the power of structured query language (SQL)? If so, you're in", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal SQL Fundamentals Workshop On Monday, 25 September, 2023, from 8:30 p.m. Event has passed [Recorded] click here to Watch on Youtube Unlock the power of data with our SQL Fundamentals Workshop! Join us on September 25, 2023, from 8:30 PM to 9:30 PM and dive into the world of structured data querying. Whether you're a beginner or a pro, this workshop will enhance your skills and boost your career. Register Now Are you looking to enhance your data management skills and unlock the power of structured query language (SQL)? If so, you're in the right place! Indeed Inspiring Infotech is thrilled to invite you to our upcoming SQL Fundamentals Workshop, designed to empower you with the essential knowledge and skills to excel in the world of data management. REGISTRATION CLOSED List of Contents Basic SQL commands for retriving and modifying data: - SELECT: Retrieve data from one or more tables. - INSERT: Add new records to a table. - UPDATE: Modify existing records. - DELETE: Remove records from a table. - Data Definition Language (DDL) CONSTRAINTS - Learn about constraints like PRIMARY KEY, UNIQUE, NOT NULL, and FOREIGN KEY for data integrity. INDEXES - Understand how to create and use indexes to optimize query performance. JOINS - Master different types of SQL joins (INNER JOIN, LEFT JOIN, RIGHT JOIN, FULL JOIN) to combine data from multiple tables. JOINAGGREGATION Functions - Use functions like COUNT, SUM, AVG, MIN, and MAX to summarize data GROUPING AND FILTERING DATA - GROUP BY and HAVING clauses for grouping and filtering query results SUBQUERIES - Write subqueries to retrieve data from nested queries SQL functions - Explore common SQL functions like DATE functions, string functions, and mathematical functions. transactions and ACID properties - Understand the concept of transactions and the properties that ensure database integrity (ACID: Atomicity, Consistency, Isolation, Durability) VIEWS - Create and use views to simplify complex queries and provide a layer of abstraction over tables stored procedures and functions - Create and use stored procedures and functions to encapsulate logic within the database Security and user Management - Learn about user privileges and how to secure your MySQL database backup and restore - Understand how to backup and restore databases to prevent data loss normalization - Learn about database normalization techniques to optimize data storage Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Industry%20Speaker%20-%20Guest%20Session", "section_title": "IndeedInspiring", "description": "On Wednesday, 2 April, 2025, from midnight Event has passed 1. Insights into AI & Data Science Learn about the latest advancements in AI, machine learning, and data science. Understand how these technologies are shaping industries and careers. 2. Career Roadmap & Interview Tips Get expert advice on career growth, job opportunities, and interview preparation. Learn how to build a strong profile and stand out to recruiters. 3. Networking with Industry Experts Connect with professionals from leadin", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Industry Speaker - Guest Session On Wednesday, 2 April, 2025, from midnight Event has passed Insights from Experts – Stay Ahead in Your Career Explore AI, data science, and the future of work with industry leaders. Learn how businesses utilize AI & ML and discover career growth opportunities. Get interview tips and networking opportunities with professionals in the field. Topics Covered: AI, Data Science & Future of Work How Businesses Are Using AI & ML? Growth & Opportunities in Tech Industry Career Roadmap & Interview Tips Benefits: Learn from Experienced Industry Professionals Network & Connect with Experts Get Exclusive Insights on Emerging Trends Free to Attend – Open for All Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways 1. Insights into AI & Data Science Learn about the latest advancements in AI, machine learning, and data science. Understand how these technologies are shaping industries and careers. 2. Career Roadmap & Interview Tips Get expert advice on career growth, job opportunities, and interview preparation. Learn how to build a strong profile and stand out to recruiters. 3. Networking with Industry Experts Connect with professionals from leading tech companies. Gain insights from their experiences and build valuable industry relationships. 4. Free & Open for All This session is free to attend, making it accessible to everyone. Enhance your knowledge and career prospects without any cost. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Business%20Analyst%20Workshop", "section_title": "IndeedInspiring", "description": "On Saturday, 21 October, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Are you ready to sharpen your business acumen and analytical skills? Indeed Inspiring Infotech cordially invites you to our FREE Online Business Analyst Workshop. This workshop is your gateway to unlocking the world of business analysis, equipping you with the tools and knowledge to thrive in the dynamic business landscape. Whether you're a seasoned professional or just starting your journey, th", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Business Analyst Workshop On Saturday, 21 October, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Discover the world of Business Analyst Are you ready to sharpen your business acumen and analytical skills? Indeed Inspiring Infotech cordially invites you to our FREE Online Business Analyst Workshop. Hands-On Labs and Exercises: This workshop is your gateway to unlocking the world of business analysis, equipping you with the tools and knowledge to thrive in the dynamic business landscape. Whether you're a seasoned professional or just starting your journey, this event is tailored for you. Certification: At the end of the bootcamp, participants will receive a certificate of completion, acknowledging their successful participation in the workshop. REGISTRATION CLOSED Key Topics Covered in Business Analyst Workshop Business Analysis Fundamentals Gain a strong foundation in business analysis methodologies and best practices. Learn how to identify business needs, define objectives, and communicate requirements effectively. This section covers requirement elicitation, stakeholder analysis, and process documentation, essential for driving business success. Data-Driven Decision Making Understand how to leverage data analysis techniques to extract insights and support business decisions. Learn how to interpret trends, create visual reports, and present actionable insights using tools like Excel, SQL, and Power BI. Hands-on exercises will help you apply these techniques to real-world business scenarios. Agile & Project Management Techniques Explore Agile methodologies and project management frameworks used in business analysis. Learn about Scrum, Kanban, and Waterfall approaches, and how they impact requirement gathering and execution. This section also covers user stories, sprint planning, and backlog management for effective project delivery. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Mobile%20Application%20Development", "section_title": "IndeedInspiring", "description": "On Saturday, 5 April, 2025, from 10 a.m. Event has passed Join us for an insightful session that delves into the foundational principles of mobile application development, providing a comprehensive overview from concept to launch. Expert-Led Presentation: A seasoned professional will guide you through the essential stages of mobile app development, including ideation, design, development, testing, and deployment. Structured Agenda: The session follows a clear, organized format to ensure a focuse", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Mobile Application Development On Saturday, 5 April, 2025, from 10 a.m. Event has passed Mobile Application Development Join us for an insightful session that delves into the foundational principles of mobile application development, providing a comprehensive overview from concept to launch.​ 🔹 How It Works: Expert-Led Presentation: A seasoned professional will guide you through the essential stages of mobile app development, including ideation, design, development, testing, and deployment.​ Structured Agenda: The session follows a clear, organized format to ensure a focused and informative experience, covering key concepts and methodologies without interactive components.​ Resource Materials: Participants will receive curated materials for further reading and exploration of the topics discussed.​ 🔹 Why Participate? Comprehensive Understanding: Gain a solid foundation in mobile app development processes, equipping you with the knowledge to navigate each phase effectively.​ Stay Updated: Learn about the latest trends and best practices in the rapidly evolving field of mobile technology.​ Professional Development: Enhance your skill set and stay competitive in the tech industry by understanding the intricacies of mobile app creation Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways: Learn & Stay Updated: Gain insights into the latest trends in mobile app development, including advancements in AI-powered personalization, integration of augmented reality (AR) and virtual reality (VR), and the rise of super applications that offer multiple services within a single platform.​ Certification: All participants will receive a certificate of completion, acknowledging their commitment to professional development in the field of mobile application development.​ Enhance Problem-Solving Skills: Deepen your understanding of the mobile app development lifecycle and learn to navigate common challenges, thereby improving your ability to design and implement effective solutions in your projects. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Panel%20Discussion:%20Data%20Driven%20Decision%20Making%20in%20Business", "section_title": "IndeedInspiring", "description": "On Friday, 4 April, 2025, from 3 p.m. Event has passed Discover how data is reshaping the way businesses operate, as industry leaders discuss the strategic role of data in driving informed decisions and fostering innovation. Expert Panel: Engage with a diverse panel of seasoned professionals who will share insights, experiences, and challenges in implementing data-driven strategies across industries. Interactive Discussion: Participate in a dynamic conversation featuring case studies, real-world", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Panel Discussion: Data Driven Decision Making in Business On Friday, 4 April, 2025, from 3 p.m. Event has passed Panel Discussion: Data-Driven Decision Making in Business Discover how data is reshaping the way businesses operate, as industry leaders discuss the strategic role of data in driving informed decisions and fostering innovation.​ 🔹 How It Works: Expert Panel: Engage with a diverse panel of seasoned professionals who will share insights, experiences, and challenges in implementing data-driven strategies across industries.​ Interactive Discussion: Participate in a dynamic conversation featuring case studies, real-world scenarios, and thought-provoking questions on leveraging data for business growth.​ Resource Materials: Attendees will receive access to hand-picked articles, tools, and frameworks to deepen their understanding of data-driven methodologies.​ 🔹 Why Participate? Stay Ahead: Learn how leading organizations harness data to stay competitive and agile in today's fast-paced business environment.​ Sharpen Your Skills: Equip yourself with actionable knowledge and best practices that can enhance your decision-making capabilities.​ Certification: All participants will be awarded a certificate of participation, reflecting their commitment to data literacy and business excellence.​ Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 🔹 Key Takeaways: Learn & Stay Updated: Explore the latest trends in data-driven decision making, from emerging tools and technologies to real-world case studies and evolving best practices, equipping you to navigate the data-centric business landscape.​ Certification: All participants will receive a certificate of completion, recognizing their proactive engagement with contemporary business intelligence and analytics practices.​ Enhance Analytical Skills: Strengthen your ability to interpret and apply data effectively in business contexts, empowering you to make informed, impactful decisions in your professional role.​ Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Daily%20Responsibilities%20of%20a%20DevOps%20Engineer:%20Streamlining%20Development%20and%20Operations", "section_title": "IndeedInspiring", "description": "On Monday, 7 April, 2025, from 9 a.m. Event has passed Learn & Stay Updated: Dive into the latest DevOps tools and practices—CI/CD pipelines, containerization, infrastructure as code, and automated monitoring—that drive efficient development cycles in today’s tech ecosystem. Certification: All participants will receive a certificate of completion, recognizing your initiative in understanding and exploring the core responsibilities of a modern DevOps engineer. Improve Problem-Solving Skills: Stre", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations On Monday, 7 April, 2025, from 9 a.m. Event has passed Behind the Scenes of DevOps Explore the daily tasks of a DevOps engineer and how they streamline development and operations for faster, smoother deployments. How It Works: Real-World Scenarios: Understand the day-to-day responsibilities in a DevOps workflow. Tool Deep-Dive: Get introduced to tools like Jenkins, Docker, Kubernetes, Git, and more. Interactive Discussion: Ask questions, explore use cases, and learn from live examples. Why Participate? Gain clarity on the role of DevOps in modern software development. Understand how automation, CI/CD pipelines, and monitoring tools optimize the development lifecycle. Boost your career by learning what it takes to succeed as a DevOps engineer in today’s tech-driven world. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways Learn & Stay Updated: Dive into the latest DevOps tools and practices—CI/CD pipelines, containerization, infrastructure as code, and automated monitoring—that drive efficient development cycles in today’s tech ecosystem. Certification: All participants will receive a certificate of completion, recognizing your initiative in understanding and exploring the core responsibilities of a modern DevOps engineer. Improve Problem-Solving Skills: Strengthen your ability to identify bottlenecks, troubleshoot systems, and automate processes by learning real-world DevOps strategies and problem-solving approaches. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/activities/", "section_title": "IndeedInspiring", "description": "Bootcamps | Competitions | Webinar | Seminar | Hackathons | FDP | STP Coding bootcamps, are structured and intensive educational programs designed to help students gain key programming and technical problem-solving skills through short but highly-focused instructional sessions. A webinar is a live event held online with a purpose to teach or inform virtual audience members about a topic. A seminar is conducted in classroom. A hackathon, also known as a codefest, is a social coding event that bri", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Activities Bootcamps | Competitions | Webinar | Seminar | Hackathons | FDP | STP Bootcamps Coding bootcamps, are structured and intensive educational programs designed to help students gain key programming and technical problem-solving skills through short but highly-focused instructional sessions. Seminars / Webinars A webinar is a live event held online with a purpose to teach or inform virtual audience members about a topic. A seminar is conducted in classroom. Hackathons A hackathon, also known as a codefest, is a social coding event that brings computer programmers and other interested people together to improve upon or build a new software program FDP Faculty Development Programme is a skill development program specially designed for academic educators. The Faculty Development Programme has been specially developed for the upgradation of skill, knowledge of the aspirants regarding technology, management or any other area of specialization. STP Student Training Program - The Program is an intensive, immersive, skills-oriented course designed to be highly interactive during the entire two days, giving the students an exposure to a blend of scholastic and experiential learning, giving them the introduction to a new cutting-edge law practice. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/How%20to%20build%201%20person%20Saas%20companies%C2%A0in%C2%A0AI", "section_title": "IndeedInspiring", "description": "On Monday, 7 April, 2025, from 9 a.m. Event has passed Build Your Own AI-Powered SaaS – Solo Learn how to build and scale solo AI-powered SaaS products with minimal resources and maximum impact. How It Works: Step-by-Step Guidance: Understand the complete roadmap from idea to launch. Toolkits & Tech Stack: Discover the essential tools and platforms to build your product efficiently. Real-Life Examples: Explore successful one-person AI SaaS stories and key takeaways. Why Participate? Gain practic", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal How to build 1 person Saas companies in AI On Monday, 7 April, 2025, from 9 a.m. Event has passed Build Your Own AI-Powered SaaS – Solo Learn how to build and scale solo AI-powered SaaS products with minimal resources and maximum impact. How It Works: Step-by-Step Guidance: Understand the complete roadmap from idea to launch. Toolkits & Tech Stack: Discover the essential tools and platforms to build your product efficiently. Real-Life Examples: Explore successful one-person AI SaaS stories and key takeaways. Why Participate? Gain practical insights into turning your AI ideas into scalable SaaS solutions. Learn to work smarter with automation and lean development techniques. Empower yourself to launch your own tech venture—no big team required! Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways Learn & Stay Updated: Explore the latest in AI-driven SaaS development, including lightweight tech stacks, automation workflows, neural networks, and efficient product design. Stay ahead in the evolving AI startup landscape. Certification: All participants will receive a certificate of completion, acknowledging your initiative in mastering solo SaaS building with AI. Improve Problem-Solving Skills: Sharpen your entrepreneurial mindset and problem-solving ability by exploring real-world use cases, lean development techniques, and practical AI integrations. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/corporate_services/", "section_title": "IndeedInspiring", "description": "The Fresher Training is also known as Induction Batch Training acts as a vital support to companies, as it shoulders the responsibility of grooming new recruits into project-ready professionals for immediate deployment on projects. Fresher Training is designed by Subject Matter Experts (SMEs) from Indeed Inspiring Infotech in collaboration with Technical Experts of the client company. The assignments and complexities of the training are decided based on project specific requirements and inputs f", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Corporate Services Fresher Training The Fresher Training is also known as Induction Batch Training acts as a vital support to companies, as it shoulders the responsibility of grooming new recruits into project-ready professionals for immediate deployment on projects. Fresher Training is designed by Subject Matter Experts (SMEs) from Indeed Inspiring Infotech in collaboration with Technical Experts of the client company. The assignments and complexities of the training are decided based on project specific requirements and inputs from the client. This program ensures that the participating candidates become readily billable & deployable resources. Participant's profile – Fresher: Graduate or postgraduate, Computer Science Major or otherwise Typical Duration - 30 to 45 days [8 hrs per day] Expected outcomes ● Sound fundamentals of programming/testing/System Administration ● Knowledge of basic set of tools and languages ● Knowledge of applying technology to solve a problem based on case studies ● Course Contents- Generally designed by the joint team of Subject Matter Expert (SME) from Indeed Inspiring Infotech and the Client in accordance with job roles/projects. List of courses Following are the modules covered as part of this type of training. All of these modules can be customized to the extent desired in the context of project requirements. ● Fundamentals- Python programming, SQL, DBMS concepts, Unix basics. Advantage Our training results are – enhanced knowledge, efficiency and productivity. We bring the best training convenience and results with: ● Customization options – Modifying existing courses, blending delivery methods, custom-designing courseware, coaching and mentoring on technologies and tools, consulting for new technology assimilation to address client-specific situation and challenges. ● Flexible approach – Classroom based Client site offerings and Online VC based offerings. ● Wide range of offerings – Information Technology, Project Management, Management development programs. ● Quality instructors – Certified technical instructors, with real-world experience working in multi-technology, multi-vendor, multi-network environments. ● Comprehensive Course/ study material – Easy to understand and comprehend study material and practical assignments. Project Based Customized Training Our aim is to facilitate the best business results for each of our clients from their technology investments. We ensure this with our innovative training solutions that are delivered just-in-time and are designed to perfectly suit and appropriately fill the requirements needs and gaps. As each technology investment requires an investment in tools and people, the corporate clients turn to Indeed Inspiring Infotech for their continual training requirements and potential manpower development needs. The Corporate Training Division provides Specific Project Based training to IT and non-IT companies. With a team of internationally certified and experienced trainers, having hands-on experience and exposure to multiple projects, these trainings are characterized by accurate problem solving and query handling. Participant's profile - Experienced working professionals – 2 to 7 years Typical Duration - 16 to 40 Hrs or 2 to 5 days Expected outcomes - Candidates should be able to apply the technology, tool or process in their current or near-future project Course Contents - Generally designed by the joint team of Senior Subject Matter Expert (SME) from Indeed Inspiring Infotech and a client Project Manager and/or Technology leader List of courses Following are the modules covered as part of this type of training. All of these modules can be customized to the extent desired in the context of project requirements. ● Fundamentals- Python programming, SQL, DBMS concepts, Unix basics. Advantage Our training results are – enhanced knowledge, efficiency and productivity. We bring the best training convenience and results with: ● Customization options – Modifying existing courses, blending delivery methods, custom-designing courseware, coaching and mentoring on technologies and tools, consulting for new technology assimilation to address client-specific situation and challenges. ● Flexible approach – Classroom based Client site offerings and Online VC based offerings. ● Wide range of offerings – Information Technology, Project Management, Management development programs. ● Quality instructors – Certified technical instructors, with real-world experience working in multi-technology, multi-vendor, multi-network environments. ● Comprehensive Course/ study material – Easy to understand and comprehend study material and practical assignments. High End Technology Training Technology vendors, on their path of continuous innovation, bring into the market new versions of their products and tools, with rapid pace. To use these products and tools effectively in the project implementation, training on effective usage of these tools is very important. With a team of highly experienced and skilled experts, Indeed Inspiring Infotech delivers such training on latest technology and tools. Typically, these trainings are conducted for spreading awareness of new technologies and tools. There are two types of training: strategic or touch-down training and other is deep-dive or detailed training. Technology vendors like Microsoft, IBM, Oracle etc., arrange for these types of training for product companies and big software development houses called as Independent Service Vendors (ISV). Participant's profile- Experienced working professionals 2 to 7 years Typical Duration- 16 to 40 hrs or 2 to 5 days Expected outcomes- Candidates should be able to apply the technology, tool or process in their current or near-future project Course Contents- Generally designed by the joint team of Senior Subject Matter Expert (SME) from Indeed Inspiring Infotech and a client Project Manager and/or Technology leader. Advantage ● Vendor certified trainers ● Experienced trainers ● Experience of managing IT infrastructure for latest tools along with trainers Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Quantum%20AI%20Workshop", "section_title": "IndeedInspiring", "description": "On Thursday, 30 November, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Join us for an insightful journey exploring fundamental concepts of quantum computing, delving into quantum algorithms for machine learning, and discovering practical applications in Quantum AI. Dive into the cutting-edge realm where quantum computing meets artificial intelligence, unraveling the latest advancements in this swiftly evolving field. Brace yourself for hands-on coding exercises, w", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Quantum AI Workshop On Thursday, 30 November, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Discover the power of QC and AI Join us for an insightful journey exploring fundamental concepts of quantum computing, delving into quantum algorithms for machine learning, and discovering practical applications in Quantum AI. Dive into the cutting-edge realm where quantum computing meets artificial intelligence, unraveling the latest advancements in this swiftly evolving field. Hands-On Labs and Exercises: Brace yourself for hands-on coding exercises, where you'll gain firsthand experience implementing quantum algorithms using industry-standard frameworks. Skills of Tomorrow This workshop promises to be an enriching learning experience, making it a must-attend for students and faculty eager to stay ahead in the realms of quantum technologies and their impact on artificial intelligence. REGISTRATION CLOSED List of Contents Introduction to Quantum Computing - Overview of classical vs. quantum computing - Basics of quantum mechanics and qubits - Quantum gates and circuits Quantum Machine Learning Foundations - Quantum states and superposition - Quantum parallelism in machine learning - Quantum versions of classical algorithms Quantum Algorithms for Machine Learning - Quantum support vector machines - Quantum clustering algorithms - Quantum neural networks Quantum Optimization - Quantum annealing - Quantum algorithms for optimization problems - Applications in machine learning and AI Quantum Entanglement in AI - Understanding entanglement - Quantum correlations and their applications in AI - Quantum teleportation and its implications Quantum Error Correction in AI - Basics of quantum error correction - Quantum error correction codes - Implementing error correction in quantum machine learning Quantum AI Applications - Quantum-enhanced algorithms for data analysis - Quantum-enhanced optimization in AI - Case studies and real-world applications Future Directions and Emerging Technologies - Current challenges and open problems in Quantum AI - Quantum computing and AI research trends - Ethical considerations in Quantum AI Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Machine%20Learning", "section_title": "IndeedInspiring", "description": "On Friday, 11 April, 2025, from 2:30 p.m. Event has passed Dive into the fundamentals of Machine Learning and explore how algorithms learn from data to drive intelligent insights, automation, and real-world applications. Learn & Stay Updated: Gain a solid foundation in machine learning concepts like regression, classification, clustering, and model evaluation. Stay current with evolving tools and technologies that drive modern ML systems. Certification: All participants will receive a certificat", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Machine Learning On Friday, 11 April, 2025, from 2:30 p.m. Event has passed Master the Power of Machine Learning Dive into the fundamentals of Machine Learning and explore how algorithms learn from data to drive intelligent insights, automation, and real-world applications. How It Works: Real-World Examples: Understand ML through hands-on case studies and use cases. Concept Made Simple: Learn the core principles behind supervised, unsupervised, and reinforcement learning in an easy, digestible way. Interactive Learning: Participate in discussions, ask questions, and gain clarity from real-time explanations. Why Participate? Grasp how Machine Learning is revolutionizing industries—from healthcare to finance. Build a strong foundation in data-driven decision-making and automation. Stay ahead in the rapidly growing AI and data science landscape Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways Learn & Stay Updated: Gain a solid foundation in machine learning concepts like regression, classification, clustering, and model evaluation. Stay current with evolving tools and technologies that drive modern ML systems. Certification: All participants will receive a certificate of completion, recognizing your effort and understanding of key machine learning principles. Improve Problem-Solving Skills: Enhance analytical thinking by working through real-world ML use cases. Understand how to turn data into decisions using powerful machine learning techniques. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com", "section_title": "IndeedInspiring", "description": "Indeed Inspiring Infotech caters to skill upgradation of individual professionals. There is a huge demand for skilled resources in most of the organizations. College/University Services Indeed Inspiring Infotech unites with colleges and universities to support their students and faculties with bridging the gap between industry demand and academics. We ensure this with our innovative training solutions that are delivered just-in-time and are designed to perfectly suit and appropriately fill the r", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal More Info Previous Next Individual Services Indeed Inspiring Infotech caters to skill upgradation of individual professionals. There is a huge demand for skilled resources in most of the organizations. Know more.. College/University Services Indeed Inspiring Infotech unites with colleges and universities to support their students and faculties with bridging the gap between industry demand and academics. We ensure this with our innovative training solutions that are delivered just-in-time and are designed to perfectly suit and appropriately fill the requirements needs and gaps. Know more.. Corporate Services The Fresher Training is also known as Induction Batch Training acts as a vital support to companies, as it shoulders the responsibility of grooming new recruits into project-ready professionals for immediate deployment on projects. Know more.. we design and deliver quality training solutions to enhance team potential. We believe, Education with L&D model help us to not only make careers but moreover make Future minds for the country. We look forward to impart Skills to all the budding Minds of the nation. VIEW ALL COURSES What we Offer Trainers We share Trainers on requirements. Trainings We deliver Corporate trainings. Courses Courses like Data Science Program are the goto courses with us. We Impart professsional Trainings in the domains that best fit for the corporates. Indeed Inspiring infotech was founded with a value system focused on training and internship programs on academics as well as on corporate level. Our breathe of services span across IT training and solutions. GET IN TOUCH Our Collaborations Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Resume%20Building", "section_title": "IndeedInspiring", "description": "On Monday, 7 April, 2025, from 2 p.m. Event has passed A practical session on resume building to help you craft impactful, job-ready resumes that stand out. Learn & Stay Updated: Discover the latest trends in resume writing, including ATS-friendly formatting, personalized content for different job roles, and the do's and don'ts that can make or break your first impression. Certification: All participants will receive a certificate of completion, recognizing your effort in developing a profession", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Resume Building On Monday, 7 April, 2025, from 2 p.m. Event has passed Craft the Perfect Resume That Gets You Noticed A practical session on resume building to help you craft impactful, job-ready resumes that stand out. How It Works: Step-by-Step Guidance: Learn how to structure your resume for different roles and industries. Real Examples: Analyze winning resumes to understand what works. Interactive Edits: Get live feedback and tips on how to improve your current resume. Why Participate? Create a professional resume that highlights your strengths and achievements. Understand what recruiters look for and how to tailor your resume accordingly. Boost your chances of landing interviews with a clear, concise, and impactful resume. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways Learn & Stay Updated: Discover the latest trends in resume writing, including ATS-friendly formatting, personalized content for different job roles, and the do's and don'ts that can make or break your first impression. Certification: All participants will receive a certificate of completion, recognizing your effort in developing a professional, career-ready resume. Improve Problem-Solving Skills: Learn how to effectively present your skills, experiences, and achievements to match job requirements and solve common resume challenges with smart, strategic approaches. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Emotional%20Intelligence", "section_title": "IndeedInspiring", "description": "On Friday, 4 April, 2025, from 4:45 p.m. Event has passed Join us for an insightful session on Emotional Intelligence designed to enhance self-awareness, empathy, and interpersonal skills. Discover how emotional intelligence can improve decision-making, strengthen relationships, and boost personal and professional growth. Develop Emotional Awareness Gain deeper insights into your emotions and learn to understand others better. Enhance Communication & Relationships Master the art of empathy and i", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Emotional Intelligence On Friday, 4 April, 2025, from 4:45 p.m. Event has passed Unlock the Power of Emotional Intelligence! Join us for an insightful session on Emotional Intelligence designed to enhance self-awareness, empathy, and interpersonal skills. Discover how emotional intelligence can improve decision-making, strengthen relationships, and boost personal and professional growth. What to Expect: ✅ Understand the key components of Emotional Intelligence. ✅ Learn practical strategies to manage emotions effectively. ✅ Enhance communication and relationship-building skills. Why Participate? Boost Personal & Professional Growth – Emotional intelligence is key to success in both life and career. Strengthen Relationships – Improve interactions with colleagues, friends, and family. Enhance Decision-Making – Make better, more thoughtful choices under pressure. Develop Leadership Skills – Effective leaders have high emotional intelligence—be one of them! Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways: Develop Emotional Awareness Gain deeper insights into your emotions and learn to understand others better. Enhance Communication & Relationships Master the art of empathy and improve your personal and professional interactions. Certification & Recognition All participants will receive a certificate of completion, recognizing their commitment to personal growth. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Data%20Fest%202025%20Quiz%20Competition", "section_title": "IndeedInspiring", "description": "On Wednesday, 2 April, 2025, from 11 a.m. Event has passed Get ready to put your knowledge to the test with the Data Fest 2025 Quiz Challenge at Data Fest 2025! This exciting, MCQ-based quiz will cover a wide range of topics, from science and technology to business, entertainment, mythology, and beyond. Daily Quizzes: 1 to 2 quizzes will be released every day. Multiple-Choice Questions (MCQs): Each quiz will have thought-provoking and engaging questions. Time Matters: The winners will be those w", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Data Fest 2025 Quiz Competition On Wednesday, 2 April, 2025, from 11 a.m. Event has passed Test Your Knowledge & Win! Get ready to put your knowledge to the test with the Data Fest 2025 Quiz Challenge at Data Fest 2025! This exciting, MCQ-based quiz will cover a wide range of topics, from science and technology to business, entertainment, mythology, and beyond. 🔹 How It Works: Daily Quizzes: 1 to 2 quizzes will be released every day. Multiple-Choice Questions (MCQs): Each quiz will have thought-provoking and engaging questions. Time Matters: The winners will be those who score the highest and submit the earliest. 🔹 Why Participate? Challenge your intellect and test your general knowledge. Compete with fellow participants from different backgrounds. Win exciting rewards and recognition for your quick thinking! Think fast, think smart, and be the first to win! Stay tuned for daily quizzes and show off your knowledge at Data Fest 2025. 🎉 Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways Learn & Stay Updated Get insights into the latest trends in technology, including full-stack development, neural networks, AI ethics, and modern UI principles. Stay ahead in your field. Certification & Prizes All participants receive a certificate of completion, and top scorers win exciting prizes. Prove your knowledge and gain recognition for your expertise. Improve Problem-Solving Skills Enhance your logical thinking and problem-solving ability by answering challenging questions. Compete with the best minds and sharpen your skills. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/HR%20Analytics", "section_title": "IndeedInspiring", "description": "Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Bui", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal HR Analytics On Wednesday, 18 September, 2024, from 11 a.m. Event has passed sample 1 REGISTRATION CLOSED sample 2 Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Workshop:%20Craft%20a%20compelling%20resume,%20master%20LinkedIn,%20and%20boost%20your%20career%20prospects", "section_title": "IndeedInspiring", "description": "On Saturday, 19 August, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Are you eager to stand out in today's competitive job market? This workshop is your golden opportunity to refine your resume and master the art of LinkedIn for a successful job search journey. Learn essential tips and strategies from industry experts to create a compelling online presence and boost your chances of landing your dream job! Craft a standout resume that grabs employers' attention Har", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects On Saturday, 19 August, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Are you eager to stand out in today's competitive job market? This workshop is your golden opportunity to refine your resume and master the art of LinkedIn for a successful job search journey. Learn essential tips and strategies from industry experts to create a compelling online presence and boost your chances of landing your dream job! REGISTRATION CLOSED Benefits of Attending- Craft a standout resume that grabs employers' attention Harness the power of LinkedIn to showcase your skills and connect with professionals Gain insights into modern job search techniques and trends Interact with experienced professionals and ask your burning questions Network with fellow job seekers and expand your opportunities Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Challenges%20of%202030", "section_title": "IndeedInspiring", "description": "On Saturday, 5 April, 2025, from 2 p.m. Event has passed Join us for an insightful session exploring the multifaceted challenges of 2030, focusing on rapid technological advancements and evolving career dynamics. 🔹 How It Works: Expert-Led Discussions: Industry leaders will delve into key topics, including the integration of artificial intelligence, the impact of automation on job markets, and strategies for continuous learning in a fast-paced environment. Comprehensive Analysis: The session wil", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Challenges of 2030 On Saturday, 5 April, 2025, from 2 p.m. Event has passed Challenges of 2025 Join us for an insightful session exploring the multifaceted challenges of 2030, focusing on rapid technological advancements and evolving career dynamics.​ 🔹 How It Works: Expert-Led Discussions: Industry leaders will delve into key topics, including the integration of artificial intelligence, the impact of automation on job markets, and strategies for continuous learning in a fast-paced environment.​ Comprehensive Analysis: The session will provide a thorough examination of current trends, potential obstacles, and actionable solutions to thrive amidst these challenges.​ Resource Materials: Participants will receive curated materials for further exploration of the subjects discussed.​ 🔹 Why Participate? Stay Informed: Understand the technological trends shaping industries. Career Preparedness: Learn about the skills projected to grow in importance, including AI and big data proficiency, and strategies to enhance employability in a transforming job market. Networking Opportunities: Connect with professionals and experts to share insights and experiences, fostering a community ready to tackle the challenges of 2030. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways: Learn & Stay Updated: Gain insights into emerging trends such as the widespread adoption of artificial intelligence, advancements in automation, and the increasing importance of digital skills across industries. ​ Certification: All participants will receive a certificate of completion, acknowledging their commitment to staying informed about future challenges and opportunities.​ Enhance Problem-Solving Skills: Develop strategies to adapt to the changing job market, focusing on continuous learning and skill development to remain competitive in the face of automation and evolving industry demands. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/ChatBot%20Bootcamp", "section_title": "IndeedInspiring", "description": "On Monday, 7 April, 2025, from 11 a.m. Event has passed Introduction to NLP & Conversational AI This is a paid event. Ticket Price: ₹100 Tickets Remaining: 499 1. Hands-on Chatbot Development Gain practical experience by building AI-powered chatbots using Dialogflow, Rasa, and LLM-based models. Work with text and voice-based chatbots to enhance conversational AI skills. 2. Deep Learning for Conversational AI Understand the role of deep learning in chatbot development. Learn how AI models process", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal ChatBot Bootcamp On Monday, 7 April, 2025, from 11 a.m. Event has passed Master Conversational AI & Build Your Own Chatbot Gain hands-on experience in chatbot development using Dialogflow, Rasa, and LLM-based bots. Learn deep learning techniques for conversational AI and real-world solutions to AI chatbot challenges. Get certified upon completion, with top performers receiving excellence certificates Contents Covered: Introduction to NLP & Conversational AI Building AI-powered Chatbots (Text & Voice) Hands-on with Dialogflow, Rasa, & LLM-based Bo Real-world Challenges & Solutions in AI Chatbots Deep Learning for Conversational AI Benefits & Certifications: Hands-on Experience in Chatbot Development Learn from Industry Experts & Solve Challenge Certificate of Completion for All Participants Top 3 Winners Get Certificates of Excellence This is a paid event. Ticket Price: ₹100 Tickets Remaining: 499 Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways 1. Hands-on Chatbot Development Gain practical experience by building AI-powered chatbots using Dialogflow, Rasa, and LLM-based models. Work with text and voice-based chatbots to enhance conversational AI skills. 2. Deep Learning for Conversational AI Understand the role of deep learning in chatbot development. Learn how AI models process language and improve interactions through real-world examples. 3. Real-World Challenges & Solutions Explore common problems in chatbot development, such as handling ambiguous queries and improving user engagement. Implement solutions used by industry experts. 4. Certification & Recognition Earn a certificate of completion, with top performers receiving excellence certificates. Showcase your skills and enhance your resume for AI-related roles. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/courses/business-analytics/", "section_title": "IndeedInspiring", "description": "Working Professional Trainers from Statistics, Big Data and machine learning industrial experience With End to End Live Projects in Different Industry, Analytics Domains Why Learn Business Analytics? Increasing Demand: Business analytics skills are in high demand across industries. Career Advancement: Business analytics skills can significantly enhance your career prospects Versatility: Business analytics skills are transferable across industries and sectors Who Can Join? Any Graduate Good Aptit", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Course Overview Covers Python, R, DBMS, Analytics, Visualizasion Working Professional Trainers from Statistics, Big Data and machine learning industrial experience With End to End Live Projects in Different Industry, Analytics Domains Why Learn Business Analytics? Increasing Demand: Business analytics skills are in high demand across industries. Career Advancement: Business analytics skills can significantly enhance your career prospects Versatility: Business analytics skills are transferable across industries and sectors Who Can Join? Any Graduate Good Aptitude and Reasoning Skills Programming or Stat Experience not required, we teach from basics Graduation or equivalent Different Jobs Available Data Scientist Data Analyst Machine Learning Engineer Deep Learning Engineer Business Analytics Professional Research Analyst Natural Language Processing Specialist Computer Vision Specialist Excel VBA Analyst Database Administrator Analytics Areas/Project Cases Customer Experience Sales Analytics Marketing Analytics Operational Analytics Network Analytics Web Analytics Financial Analytics Stock Market Log Analytics Service Desk, Tickets Analytics HR Analytics Admission Process The Certification Program in Data Science is ideal for students and professionals who are interested in working in the analytics industry and dare keen on enhancing their technical skills with exposure to cutting-edge practices. Eligibility: Any Graduate and Professional Enrollment Form link: https://forms.gle/e2gr6ZwpJ6SQ12YR9 Select Data Science Certification Program Download Brochure Register Here Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Gen%20AI", "section_title": "IndeedInspiring", "description": "On Friday, 11 April, 2025, from 10 a.m. Event has passed Learn & Stay Updated: Discover how Generative AI is driving breakthroughs in content creation, design, storytelling, and development. Stay informed on the latest models, trends, and real-world applications of Gen AI. Certification: All participants will receive a certificate of completion, recognizing your engagement in exploring one of the most transformative areas of artificial intelligence. Improve Problem-Solving Skills: Boost your cre", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Gen AI On Friday, 11 April, 2025, from 10 a.m. Event has passed Unleash Creativity with Generative AI Explore the world of Generative AI and how it's reshaping creativity, content, and innovation. How It Works: Live Demos: Watch Generative AI in action — from text and image creation to music and code. Concepts Made Simple: Understand the core models like GPT, DALL·E, and more in an easy, accessible way. Interactive Learning: Ask questions, try tools live, and engage in creative experiments. Why Participate? Discover how Gen AI is revolutionizing industries like design, marketing, education, and software. Gain hands-on experience with cutting-edge tools transforming human-AI collaboration. Stay ahead of the curve in the fast-evolving world of artificial intelligence! Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways Learn & Stay Updated: Discover how Generative AI is driving breakthroughs in content creation, design, storytelling, and development. Stay informed on the latest models, trends, and real-world applications of Gen AI. Certification: All participants will receive a certificate of completion, recognizing your engagement in exploring one of the most transformative areas of artificial intelligence. Improve Problem-Solving Skills: Boost your creativity and analytical thinking by engaging with real-world Gen AI tools and solving challenges through intelligent automation and innovative design. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Hack%20-%20The%20-%20Need%20(Amdocs)", "section_title": "IndeedInspiring", "description": "Hack-The-Need: Discover Solutions and Build a Product Join us on 15th January 2025 for an exciting day-long event, Hack-The-Need, designed to fuel innovation and practical learning. This unique hands-on training session brings together industry experts to provide valuable insights and real-world applications in emerging fields. This session is your gateway to exploring cutting-edge concepts and skills that are shaping the future of technology. Topics Covered - Computer Vision & Hands-On Learning", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Hack - The - Need (Amdocs) On Wednesday, 15 January, 2025, from 10 a.m. Event has passed Hack-The-Need: Discover Solutions and Build a Product Join us on 15th January 2025 for an exciting day-long event, Hack-The-Need, designed to fuel innovation and practical learning. This unique hands-on training session brings together industry experts to provide valuable insights and real-world applications in emerging fields. This session is your gateway to exploring cutting-edge concepts and skills that are shaping the future of technology. Topics Covered Computer Vision & Hands-On Learning Speaker: Mr. Kushal Sharma, Director at Prushal Tech Pvt. Ltd. Dive into the world of computer vision and gain hands-on experience to understand how this transformative technology is reshaping industries. Fundamentals of GIS & Practical Applications Speaker: Mr. Bhavesh Ahire, SME in Robotics & Automation, SkillSonics Explore the essentials of GIS (Geographic Information Systems) and learn how it can be applied practically in diverse domains. REGISTRATION CLOSED Who Should Attend? Technology enthusiasts looking to upgrade their skills. Professionals eager to gain hands-on experience in Computer Vision and GIS. Students aiming to understand real-world applications of advanced technologies. Innovators and problem solvers interested in building products with cutting-edge solutions Challenge Themes: Digitize Extraction of Measurement Metadata from Field Captures of Utility Pole. Embed Geo-positioning Details into Existing Landbase Maps to Create Digital Spatial Maps. Key Takeaways for Attendees: Real-World Expertise: Gain insights from industry leaders with extensive experience. Hands-On Training: Practical sessions to apply concepts and solidify learning. Network with Experts: Opportunity to connect with professionals and peers in the field. Skill Enhancement: Learn high-demand skills that are relevant in today's tech-driven landscape. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/", "section_title": "IndeedInspiring", "description": "Indeed Inspiring Infotech caters to skill upgradation of individual professionals. There is a huge demand for skilled resources in most of the organizations. College/University Services Indeed Inspiring Infotech unites with colleges and universities to support their students and faculties with bridging the gap between industry demand and academics. We ensure this with our innovative training solutions that are delivered just-in-time and are designed to perfectly suit and appropriately fill the r", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal More Info Previous Next Individual Services Indeed Inspiring Infotech caters to skill upgradation of individual professionals. There is a huge demand for skilled resources in most of the organizations. Know more.. College/University Services Indeed Inspiring Infotech unites with colleges and universities to support their students and faculties with bridging the gap between industry demand and academics. We ensure this with our innovative training solutions that are delivered just-in-time and are designed to perfectly suit and appropriately fill the requirements needs and gaps. Know more.. Corporate Services The Fresher Training is also known as Induction Batch Training acts as a vital support to companies, as it shoulders the responsibility of grooming new recruits into project-ready professionals for immediate deployment on projects. Know more.. we design and deliver quality training solutions to enhance team potential. We believe, Education with L&D model help us to not only make careers but moreover make Future minds for the country. We look forward to impart Skills to all the budding Minds of the nation. VIEW ALL COURSES What we Offer Trainers We share Trainers on requirements. Trainings We deliver Corporate trainings. Courses Courses like Data Science Program are the goto courses with us. We Impart professsional Trainings in the domains that best fit for the corporates. Indeed Inspiring infotech was founded with a value system focused on training and internship programs on academics as well as on corporate level. Our breathe of services span across IT training and solutions. GET IN TOUCH Our Collaborations Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/%F0%9F%94%A5%20Hackathon%20(Technology%20&%20Innovation%20Challenge)", "section_title": "IndeedInspiring", "description": "On Thursday, 10 April, 2025, from 11 a.m. Event has passed Participants choose from domains like AI/ML, IoT, Healthcare, Finance, Smart Cities, Manufacturing, Environment & Sustainability. Solve real-world problem statements using cutting-edge technologies. Develop a prototype/MVP in a given time frame. Present the working demo to industry experts. 1️⃣ Problem Selection & Idea Proposal – Submit a brief plan. 2️⃣ Prototype Development – Code, build, test. 3️⃣ Final Presentation & Demo – Live show", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal 🔥 Hackathon (Technology & Innovation Challenge) On Thursday, 10 April, 2025, from 11 a.m. Event has passed How It Works: Participants choose from domains like AI/ML, IoT, Healthcare, Finance, Smart Cities, Manufacturing, Environment & Sustainability. Solve real-world problem statements using cutting-edge technologies. Develop a prototype/MVP in a given time frame. Present the working demo to industry experts. Rounds: 1️⃣ Problem Selection & Idea Proposal – Submit a brief plan. 2️⃣ Prototype Development – Code, build, test. 3️⃣ Final Presentation & Demo – Live showcase to judges. Benefits & Recognition: 🏆 1st Prize: ₹1000 cash + Trophy + Winner Certificate 🎖 Finalists: Certificates of Achievement 📜 All Participants: Participation Certificates 🔹 Networking with industry leaders 🔹 Internship & Job Opportunities 🔹 Project Showcase for Future Investments Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Join the Innovation Revolution at DataFest 2025! 🚀 The Hackathon at DataFest 2025 isn’t just a competition—it’s an opportunity to push the boundaries of technology, solve real-world industry challenges, and bring groundbreaking ideas to life. Whether you’re a developer, data scientist, engineer, healthcare professional, or business strategist, this is your chance to showcase your skills, collaborate with like-minded innovators, and make an impact. With industry mentors, networking opportunities, cash prizes, and potential career breakthroughs, this event is designed to bridge the gap between technology and business innovation. So, gear up, think big, and code your way to success! 📢 Register now and be part of the future of innovation! 🔥 Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/individual_services/", "section_title": "IndeedInspiring", "description": "Indeed Inspiring Infotech caters to skill upgradation of individual professionals. There is a huge demand for skilled resources in most of the organizations. The individuals can avail these services. Fresher: Graduate or postgraduate Typical Duration- 30 to 45 days [8 hrs per day] ● Sound fundamentals of programming/testing/System Administration ● Knowledge of basic set of tools and languages ● Knowledge of applying technology to solve a problem based on case studies ● Course Contents- Generally", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Individual Services Indeed Inspiring Infotech caters to skill upgradation of individual professionals. There is a huge demand for skilled resources in most of the organizations. The individuals can avail these services. Participant’s profile – Fresher: Graduate or postgraduate Typical Duration- 30 to 45 days [8 hrs per day] Expected outcomes ● Sound fundamentals of programming/testing/System Administration ● Knowledge of basic set of tools and languages ● Knowledge of applying technology to solve a problem based on case studies ● Course Contents- Generally designed by the joint team of Subject Matter Expert (SME) from Indeed Inspiring Infotech and the Client in accordance with job roles/projects. List of courses ● Following are the modules covered as part of this type of training. All of these modules can be customized to the extent desired in the context of project requirements. ● Fundamentals- Python programming, SQL, DBMS concepts, Unix basics ● Data Science, Artificial Intelligence and Machine Learning ● Data Engineering, Data Warehousing, ETL, Big Data ● Business Analytics, Tableau, PowerBI Advantage Our training results are – enhanced knowledge, efficiency and productivity. We bring the best training convenience and results with: ● Customization options – Modifying existing courses, blending delivery methods, custom-designing courseware, coaching and mentoring on technologies and tools, consulting for new technology assimilation to address client-specific situation and challenges ● Flexible approach – Classroom based Client site offerings and Online VC based offerings ● Wide range of offerings – Information Technology, Project Management, Management development programs ● Quality instructors – Certified technical instructors, with real-world experience working in multi-technology, multi-vendor, multi-network environments ● Comprehensive Course/ study material – Easy to understand and comprehend study material and practical assignments. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Leadership%20and%20Marketing", "section_title": "IndeedInspiring", "description": "On Thursday, 3 April, 2025, from 1:30 p.m. Event has passed Join us for an insightful session on Marketing and Leadership, designed to enhance your understanding of effective strategies in these critical business areas. Expert Presentation: Our guest speaker will deliver a comprehensive lecture covering key concepts and trends in marketing and leadership. Expand Your Knowledge: Gain valuable insights into the latest strategies and best practices in marketing and leadership. Professional Developm", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Leadership and Marketing On Thursday, 3 April, 2025, from 1:30 p.m. Event has passed Marketing and Leadership Guest Session Join us for an insightful session on Marketing and Leadership, designed to enhance your understanding of effective strategies in these critical business areas.​ 🔹 How It Works: Expert Presentation: Our guest speaker will deliver a comprehensive lecture covering key concepts and trends in marketing and leadership.​ 🔹 Why Participate? Expand Your Knowledge: Gain valuable insights into the latest strategies and best practices in marketing and leadership.​ Professional Development: Enhance your skill set, making you better equipped to tackle challenges in these domains. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways: Learn & Stay Updated: Gain insights into the latest trends and best practices in marketing and leadership, including strategies for aligning marketing efforts with business objectives, fostering innovation, and leading teams effectively. ​ Certification: All participants will receive a certificate of completion, recognizing their commitment to professional development in the fields of marketing and leadership.​ Enhance Strategic Thinking: Develop your ability to think strategically about marketing initiatives and leadership challenges, equipping you with the tools to drive organizational growth and success. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Effective%20Java:%20Code-Level%20Optimizations%20for%20Performance%20and%20Maintainability", "section_title": "IndeedInspiring", "description": "On Saturday, 5 April, 2025, from 12:15 p.m. Event has passed Explore the power of writing clean, efficient, and maintainable Java code as we dive into best practices, performance tuning, and design principles that make your Java applications robust and future-proof. Expert Presentation An experienced Java professional will walk you through essential practices from the \"Effective Java\" playbook—covering topics like object creation, immutability, exception handling, and more. Conceptual Insights U", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Effective Java: Code-Level Optimizations for Performance and Maintainability On Saturday, 5 April, 2025, from 12:15 p.m. Event has passed Effective Java: Code-Level Optimization for Performance and Maintainability Explore the power of writing clean, efficient, and maintainable Java code as we dive into best practices, performance tuning, and design principles that make your Java applications robust and future-proof. 🔹 How It Works Expert Presentation An experienced Java professional will walk you through essential practices from the \"Effective Java\" playbook—covering topics like object creation, immutability, exception handling, and more. Conceptual Insights Understand how thoughtful code-level decisions impact performance and maintainability. Learn about memory optimization, clean code architecture, design patterns, and the trade-offs behind common coding practices. 🔹 Why Participate? Stay Updated Get aligned with modern Java development practices that emphasize scalability, maintainability, and code clarity skills highly valued in today’s software industry. Level Up Your Coding Improve the quality of your Java codebase by learning practical strategies for writing better, cleaner, and more efficient programs. Certification All attendees will receive a certificate of participation, acknowledging their commitment to mastering Java optimization techniques and clean coding principles. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 🔹 Key Takeaways Develop a Performance-First Mindset Understand how to think like a performance-oriented developer by identifying inefficiencies and applying proven techniques to write scalable, maintainable Java code. Certification All participants will receive a certificate of completion, recognizing their dedication to mastering effective Java techniques and writing high-quality code. Enhance Analytical Skills Sharpen your ability to analyze, refactor, and improve existing codebases using techniques that prioritize performance, clarity, and maintainability in real-world development. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Web%20Development%20Bootcamp", "section_title": "IndeedInspiring", "description": "On Wednesday, 2 April, 2025, from 11 a.m. Event has passed 1. Master Frontend & Backend Development Gain in-depth knowledge of HTML, CSS, JavaScript, React, Tailwind CSS, Node.js, Django, and Express.js. Learn to build and deploy full-stack applications. 2. Real-World Projects & Hands-On Training Work on live projects to apply your skills in a real-world setting. Develop web applications that showcase modern design and functionality. 3. Learn Modern Web Development Techniques Understand best pra", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Web Development Bootcamp On Wednesday, 2 April, 2025, from 11 a.m. Event has passed Code, Build & Innovate – Solve Real-World Challenges Work on AI/ML-based full-stack development challenges with real industry problem statements. Implement cloud, API, and database integration in a collaborative coding environment. Receive certification and gain networking opportunities, with exclusive prizes for winners. Contents Covered: HTML, CSS, JavaScript – Foundations of Web Development Frontend Frameworks – React, Tailwind CSS Backend Development – Node.js, Django, Express.js Building & Deploying Full-Stack Applications Benefits & Certifications: Hands-on Training with Real-World Projects Learn Modern Web Development Tools & Techniques Certificate of Completion for All Participants Top 3 Performers Receive Excellence Certificates Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways 1. Master Frontend & Backend Development Gain in-depth knowledge of HTML, CSS, JavaScript, React, Tailwind CSS, Node.js, Django, and Express.js. Learn to build and deploy full-stack applications. 2. Real-World Projects & Hands-On Training Work on live projects to apply your skills in a real-world setting. Develop web applications that showcase modern design and functionality. 3. Learn Modern Web Development Techniques Understand best practices for responsive web design, API integration, and database management. Stay updated with industry-standard tools and frameworks. 4. Certification & Excellence Recognition All participants receive a completion certificate, while top performers are awarded certificates of excellence. Boost your resume with verified skills. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/DevOps:%20Mastering%20Hands-On%20Training%20for%20Modern%20Software%20Development", "section_title": "IndeedInspiring", "description": "Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Bui", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal DevOps: Mastering Hands-On Training for Modern Software Development On Friday, 31 January, 2025, from 10 a.m. Event has passed sample 1 REGISTRATION CLOSED sample 2 Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Team%20work%20and%20Public%20Speaking", "section_title": "Server Error (500)", "description": "No meaningful description available.", "text": "Server Error (500) Server Error (500)"}
{"url": "https://indeedinspiring.com/event_page/HR%20Virtual%20Meetup:%20Bridging%20Talent,%20Training,%20and%20Transformation", "section_title": "IndeedInspiring", "description": "On Friday, 20 December, 2024, from 10 a.m. Event has passed The HR Virtual Meetup on 20th December 2024 (Friday) is an exclusive event designed to bring together HR professionals, learning and development (L&D) leaders, academic placement officers, and organizational decision-makers on a single platform. The event aims to address the growing challenges of talent development, skill-gap analysis, and the establishment of effective L&D systems in today’s dynamic corporate environment. This 75-minut", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal HR Virtual Meetup: Bridging Talent, Training, and Transformation On Friday, 20 December, 2024, from 10 a.m. Event has passed HR Virtual Meetup: Bridging Talent, Training, and Transformation The HR Virtual Meetup on 20th December 2024 (Friday) is an exclusive event designed to bring together HR professionals, learning and development (L&D) leaders, academic placement officers, and organizational decision-makers on a single platform. The event aims to address the growing challenges of talent development, skill-gap analysis, and the establishment of effective L&D systems in today’s dynamic corporate environment. This 75-minute interactive session will provide valuable insights into modern corporate training strategies, tools for skill-gap identification, and methods for post-training assessments to ensure measurable results. With the ever-changing demands of industries, HR professionals and educational institutions must work hand-in-hand to prepare a workforce that is not only skilled but also future-ready. The agenda includes key topics such as corporate training trends, building talent pools, and post-training assessments, offering practical approaches to align training initiatives with business goals. Through engaging discussions led by experienced industry experts, attendees will gain actionable takeaways to optimize their L&D systems, improve training ROI, and nurture talent more effectively. For HR leaders, this meetup will highlight strategies to implement sustainable training programs and bridge workforce skill gaps. For training and placement departments, the session will provide insights into collaborating with industry partners, skill mapping, and preparing students for real-world opportunities. The event also encourages an open platform for Q&A, where participants can share challenges and explore solutions tailored to their organizational or institutional needs. Join us to connect, collaborate, and contribute to the evolution of workforce development through a shared vision for bridging talent, training, and transformation. Together, let’s build a stronger bridge between academia and the corporate world to shape the future of learning and development. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Who Should Attend? 1. HR Professionals (L&D Managers, Talent Acquisition Managers, HR Directors, HR Managers) 2. Founders and Directors of Organizations 3. Training & Placement Officers from Colleges/Universities 4. Academic Leaders interested in Employability and Industry Collaboration Topics: Future-Proofing Workforce: Aligning training with evolving industry needs. Upskilling vs. Reskilling: Prioritizing investments in talent. Gamification in L&D: Boosting training engagement. Tech-Driven Skill Gap Analysis: Leveraging AI for accurate insights. Building Effective L&D Systems: Overcoming challenges and ensuring ROI. Talent Pool Strategies: Nurturing pipelines for critical roles. Post-Training Assessments: Measuring impact and continuous improvement. AI in HR: Transforming recruitment and performance management. Employee Well-Being: Integrating L&D with wellness programs. Taken HR as Business Partners: Shaping strategy beyond administration. Key Takeaways for Attendees: 1. Understand Current Trends: Insights on modern corporate training strategies and frameworks. 2. Skill-Gap Solutions: Tools and methodologies to identify and bridge skill gaps. 3. L&D Implementation: Practical approaches to building a robust and measurable L&D system. 4. Collaboration: Opportunities to collaborate between academia and industry for workforce readiness. 5. Assessment Frameworks: Effective methods for evaluating post-training effectiveness and ROI. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Customer%20Relation%20and%20Order%20Management", "section_title": "IndeedInspiring", "description": "On Tuesday, 1 April, 2025, from 7 p.m. Event has passed Join us for an engaging session that delves into the essentials of Customer Relationship Management (CRM) and Order Management. This informative event is designed to provide valuable insights into building strong customer relationships and optimizing order processes to enhance business success. Expert-Led Session: Gain knowledge from industry professionals with extensive experience in CRM and Order Management. Interactive Q&A: Participate i", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Customer Relation and Order Management On Tuesday, 1 April, 2025, from 7 p.m. Event has passed Customer Relationship and Order Management Join us for an engaging session that delves into the essentials of Customer Relationship Management (CRM) and Order Management. This informative event is designed to provide valuable insights into building strong customer relationships and optimizing order processes to enhance business success.​ 🔹 How It Works: Expert-Led Session: Gain knowledge from industry professionals with extensive experience in CRM and Order Management.​ Interactive Q&A: Participate in a live question-and-answer segment to address your specific queries and challenges.​ Resource Materials: Access supplementary materials and templates to implement best practices in your organization.​ 🔹 Why Participate? Enhance Your Skills: Learn about the latest strategies and tools in customer relationship and order management to stay competitive in your field.​ Network with Professionals: Connect with peers and industry experts to share experiences and build your professional network.​ Receive Recognition: All participants will receive a certificate of attendance, acknowledging their commitment to professional development. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways: Learn & Stay Updated: Gain insights into the latest trends and technologies in CRM and order management, including the integration of digital tools and data analytics to foster stronger customer relationships and optimize order fulfillment processes.​ Certification & Prizes: All attendees will receive a certificate of participation, acknowledging their commitment to professional development in this domain. Additionally, top participants will have the opportunity to win exciting prizes, recognizing their engagement and understanding of the session's content.​ Improve Problem-Solving Skills: Enhance your analytical and strategic thinking abilities by exploring real-world challenges in customer relations and order management. Learn how to apply best practices to resolve issues effectively, thereby improving overall business operations. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/data-fest/", "section_title": "IndeedInspiring", "description": "Event Highlights Data Fest 2025 will feature a diverse range of sessions, bringing together knowledge from various industries and disciplines. Explore cutting-edge advancements in AI, cloud computing, blockchain, and cybersecurity, along with insightful sessions on soft skills, personality development, resume building, and career transitions. Dive into specialized topics like medical coding, environmental sustainability, and carbon footprints. Engage in hands-on workshops, networking opportuniti", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal 🚀 Welcome to Data Fest 2025! 🔥 Data Fest 2025 is an inclusive and immersive educational festival designed for everyone—whether you're a student, faculty member, working professional, or entrepreneur. No matter your field—be it manufacturing, pharmaceuticals, management, customer care, entertainment, or any other industry—this event is for you! Join us in a dynamic celebration of learning, where knowledge is shared and gained through hands-on boot camps, hackathons, competitions, and expert-led sessions. Data Fest 2025 is more than just a tech event; it’s a platform for individuals from diverse backgrounds to explore, innovate, and grow together. Come be a part of this vibrant experience and expand your horizons! Secure Your Spot Now! 🎟️ Our Collaborations Event Highlights Data Fest 2025 will feature a diverse range of sessions, bringing together knowledge from various industries and disciplines. Explore cutting-edge advancements in AI, cloud computing, blockchain, and cybersecurity, along with insightful sessions on soft skills, personality development, resume building, and career transitions. Dive into specialized topics like medical coding, environmental sustainability, and carbon footprints. Engage in hands-on workshops, networking opportunities, and panel discussions with industry experts. Whether you're a beginner or an experienced professional from any field, there’s something for everyone at this educational festival! ChatBot Bootcamp April 2, 2025 Dive into the world of conversational AI! Learn to design, develop, and deploy chatbots using NLP and machine learning techniques. Quiz competitions April 3, 2025 Join the MCQ quiz competition at Data Fest 2025! With daily quizzes on diverse topics, aim to score the highest and submit the fastest to win. Compete, learn, and secure your top spot! Ideathon April 4, 2025 Brainstorm and pitch groundbreaking ideas! Collaborate with experts and innovators to develop creative solutions to real-world problems. Hackathon April 5-6, 2025 Engage in an intense coding marathon! Solve industry challenges, build innovative applications, and compete with top developers. Web development Bootcamp April 7, 2025 Master modern web development! Learn front-end and back-end technologies, explore frameworks like React and Django, and build scalable applications. B-Plan Competition – Pitch, Innovate, Succeed! 🚀 April 8, 2025 Got a groundbreaking business idea? Pitch, refine, and validate it with expert feedback. Open to students, entrepreneurs, and professionals, it’s your chance to turn ideas into reality! Secure Your Spot! Register today to access exclusive insights from industry leaders. Register Now × How to Register for an Event Go to the Events section in the navigation bar. Click on Upcoming Events to see the list of available events. Select the event you are interested in by clicking on its name. You will be redirected to the event page. Click the Register button on the event page. You can register for multiple events based on your interest. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Cryptography%20and%20Techniques", "section_title": "IndeedInspiring", "description": "On Saturday, 5 April, 2025, from 3 p.m. Event has passed Delve into the fascinating world of cryptography as we explore the fundamental concepts, techniques, and real-world applications that underpin secure communication and data protection in the digital age. Expert Presentation: A seasoned expert will provide a comprehensive overview of cryptographic methods, from classical algorithms to modern encryption techniques used in securing digital systems. Conceptual Insights: Learn about key cryptog", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Cryptography and Techniques On Saturday, 5 April, 2025, from 3 p.m. Event has passed Cryptography and Techniques Delve into the fascinating world of cryptography as we explore the fundamental concepts, techniques, and real-world applications that underpin secure communication and data protection in the digital age.​ 🔹 How It Works: Expert Presentation: A seasoned expert will provide a comprehensive overview of cryptographic methods, from classical algorithms to modern encryption techniques used in securing digital systems.​ Conceptual Insights: Learn about key cryptographic principles such as symmetric and asymmetric encryption, hashing, digital signatures, and their role in maintaining data integrity and confidentiality.​ Resource Materials: Participants will receive curated learning materials for deeper exploration of the cryptographic techniques and topics covered in the session.​ 🔹 Why Participate? Stay Informed: Understand how cryptography is evolving to meet modern security challenges, and why it's critical in today’s data-driven world.​ Enhance Professional Competence: Build a solid foundation in cryptographic techniques that are essential for careers in cybersecurity, software development, and data protection.​ Certification: All attendees will receive a certificate of participation, recognizing their commitment to understanding the essentials of cryptographic security.​ Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 🔹 Key Takeaways: Learn & Stay Updated: Gain insights into the core principles and evolving trends in cryptography, including encryption algorithms, digital signatures, and real-world use cases, helping you stay informed about this critical field in cybersecurity.​ Certification: All participants will receive a certificate of completion, acknowledging their commitment to understanding and applying cryptographic techniques.​ Enhance Analytical Skills: Strengthen your ability to assess and interpret cryptographic methods, enhancing your capability to apply these concepts in data security, software development, and related professional domains.​ Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/courses/", "section_title": "IndeedInspiring", "description": "Learn all the industry leading technologies with us with vast hands on experiences. May it be Data Science, Python, Tableau, Hadoop and the list is endless….. The content is designed by keeping in mind the industry job requirements. We have trained non-IT graduates such as BCom as well as Computer Engg, We have collectively worked on 70+ Data Science Live projects since 2014. That experience has helped us create a unique curriculum with real time Live projects coverage. Dedicated industry leader", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Courses Learn all the industry leading technologies with us with vast hands on experiences. May it be Data Science, Python, Tableau, Hadoop and the list is endless….. About Training Program The content is designed by keeping in mind the industry job requirements. We have trained non-IT graduates such as BCom as well as Computer Engg, We have collectively worked on 70+ Data Science Live projects since 2014. That experience has helped us create a unique curriculum with real time Live projects coverage. Industry Connect Industry Mentorship Dedicated industry leaders to guide you through any career related queries and chart your career roadmap. II Meetup Exchange ideas and interact with industry experts at Indeed Inspiring’ networking events. Curriculum Experimental Learning Real-world case studies, in- class projects and live capstone project to internalize key concepts. Industry-Endorsed Curriculum Holistic, practically-driven curriculum designed by industry experts to ensure job readines Employment Assistance Career Services Supercharge your employability through mock interviews, resume building, and assured placements at leading Analytics firms Placement-Driven Hachathon Exchange ideas and interact with industry experts at Indeed Inspiring’ networking events. Data Science Program Accelerate your career with our Data Science program Diploma Level intensive Training and Internship Program 6 months Business Analytics Learn all the industry leading technologies with us with vast hands on experiences. May it be Data Science, Python, Tableau, Hadoop and the list is endless….. 6 months Advance Excel Workshop Learn Excel like a pro with our advanced techniques! Digital Marketing Revamp your digital marketing game with our expert tips! Explainable Artificial Intelligence Unravel the mysteries of AI with our explainable approach! Generative AI in Law AI for the legal world: A generative approach! HR Analytics Transform your HR with data-driven insights! MLOPs Streamline your ML workflow with our MLOps course! Program Management Course Lead your projects to success with our program management course! SQL Fundamentals Course Unlock the power of SQL with our fundamentals course! E-commerce Training Learn How does an E-commerce work Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/career/", "section_title": "IndeedInspiring", "description": "Join to experience the thrill of train the generation campaign with an amazing team! Imparting the generation with skills is one of the many works we do. Salary based on working hours. So you can give your 100% during the hours. Parties to cheer you up for the achievements and further goal settings. Team outing activities from office environment to natural environment. to foster connection with the nature. Mentally peaceful environment to work with best of yourself.", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Join The Team Ready to make an impact? Join to experience the thrill of train the generation campaign with an amazing team! Imparting the generation with skills is one of the many works we do. Get your ticket to Indeed Inspiring!> Perks & Benefits Competitve Salary Salary based on working hours. So you can give your 100% during the hours. Company Parties Parties to cheer you up for the achievements and further goal settings. Team Outing Team outing activities from office environment to natural environment. to foster connection with the nature. Mentally Fit Mentally peaceful environment to work with best of yourself. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/courses/creative-thinking-and-problem-solving-workshop/", "section_title": "IndeedInspiring", "description": "Enhancing Creative Thinking and Problem Solving Ability Expected Areas of Improvement Problem Solving Skills - ANALYTICAL THINKING - CRITICAL THINKING - DECISION MAKING - RESEARCH SKILLS - PROBLEM IDENTIFICATION - CREATIVE PROBLEM SOLVING - RESOURCE FULNESS - SYSTEMS THINKING - ADAPTABILITY - COLLABORATION Expected Areas of Improvement Creative Thinking Skills - FLUENCY - FLEXIBILITY - ORIGINALITY - VISUALIZATION - CURIOSITY - OPEN MINDEDNESS - RISK TAKING - CONNECTING IDEAS - PLAYFULNESS - PERS", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Enhancing Creative Thinking and Problem Solving Ability Expected Areas of Improvement Problem Solving Skills ANALYTICAL THINKING CRITICAL THINKING DECISION MAKING RESEARCH SKILLS PROBLEM IDENTIFICATION CREATIVE PROBLEM SOLVING RESOURCE FULNESS SYSTEMS THINKING ADAPTABILITY COLLABORATION Expected Areas of Improvement Creative Thinking Skills FLUENCY FLEXIBILITY ORIGINALITY VISUALIZATION CURIOSITY OPEN MINDEDNESS RISK TAKING CONNECTING IDEAS PLAYFULNESS PERSISTENCE Activities and Frameworks Brainstorming Mind Mapping Reverse Thinking Analogies Role Playing SCAMPER Technique Random Word Association Six Thinking Hats Activities and Frameworks SCAMPER with Random Objects Puzzle Solving Thought Experiments Keep a Journal Collaborative Projects Visualization Exercises Reflection and Evaluation Download Brochure Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/AI%20in%20Weather%20Prediction", "section_title": "IndeedInspiring", "description": "On Tuesday, 8 April, 2025, from 11:30 a.m. Event has passed Learn & Stay Updated: Gain insights into how machine learning, big data, and neural networks are being applied to enhance the accuracy and speed of weather forecasting systems. Stay ahead in the intersection of AI and climate science. Certification: All participants will receive a certificate of completion, recognizing your initiative in exploring innovative applications of AI in environmental and predictive technologies. Improve Proble", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal AI in Weather Prediction On Tuesday, 8 April, 2025, from 11:30 a.m. Event has passed Smarter Forecasting with AI Discover how AI is transforming weather prediction with faster, smarter, and more accurate forecasts. How It Works: Real-Time Insights: See how AI models analyze vast datasets to predict weather patterns. Simplified Explanations: Understand the technology behind AI-powered forecasting, from machine learning to neural networks. Interactive Session: Ask questions, explore live examples, and discuss real-world applications of AI in meteorology. Why Participate? Explore how AI is revolutionizing one of the most critical areas of data science—weather forecasting. Understand the role of AI in disaster preparedness, agriculture, and climate monitoring. Stay informed on cutting-edge tech that’s shaping the future of environmental intelligence. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways Learn & Stay Updated: Gain insights into how machine learning, big data, and neural networks are being applied to enhance the accuracy and speed of weather forecasting systems. Stay ahead in the intersection of AI and climate science. Certification: All participants will receive a certificate of completion, recognizing your initiative in exploring innovative applications of AI in environmental and predictive technologies. Improve Problem-Solving Skills: Develop critical thinking by understanding how AI tackles real-world challenges in climate modeling, disaster preparedness, and data-driven forecasting. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/AWS%20Mastery%20Bootcamp:%20Level%20Up%20Your%20Cloud%20Skills", "section_title": "IndeedInspiring", "description": "On Saturday, 30 September, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube This course is designed to provide participants with a comprehensive understanding of cloud computing and AWS services. Whether you're a beginner looking to get started with the cloud or an experienced professional aiming to refine your AWS expertise, this bootcamp offers something for everyone. Throughout the bootcamp, participants will engage in hands-on labs and exercises to apply what they", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal AWS Mastery Bootcamp: Level Up Your Cloud Skills On Saturday, 30 September, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Discover the power of AWS This course is designed to provide participants with a comprehensive understanding of cloud computing and AWS services. Whether you're a beginner looking to get started with the cloud or an experienced professional aiming to refine your AWS expertise, this bootcamp offers something for everyone. Hands-On Labs and Exercises: Throughout the bootcamp, participants will engage in hands-on labs and exercises to apply what they've learned in each module. These practical activities will help reinforce their understanding of AWS services and concepts. Certification: At the end of the bootcamp, participants will receive a certificate of completion, acknowledging their successful mastery of AWS fundamentals and practical skills. REGISTRATION CLOSED Key Topics Covered in AWS Cloud Workshop 1. Introduction to Cloud Computing Basics of Cloud Computing and its advantages Service Models: IaaS, PaaS, SaaS Deployment Models: Public, Private, Hybrid Overview of AWS as a leading cloud provider 2. Setting Up AWS Free Tier Account Creating and managing an AWS Free Tier account Navigating the AWS Management Console Billing & cost management strategies Enabling Multi-Factor Authentication (MFA) for security 3. AWS Storage with S3 Understanding Amazon S3 and its use cases Creating and managing S3 buckets & objects Implementing versioning, lifecycle policies, and security 4. AWS Compute with EC2 Launching and configuring EC2 instances Understanding instance types, security groups, and networking Connecting to EC2 instances & using Amazon Machine Images (AMIs) 5. AWS CLI & Application Deployment Setting up and using AWS Command Line Interface (CLI) Managing EC2 and S3 via CLI commands Running a live demo & hands-on practice sessions Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Looking%20into%20GenAI%20from%202025", "section_title": "IndeedInspiring", "description": "On Friday, 4 April, 2025, from 11 a.m. Event has passed Embark on an exploratory journey into the state of Generative AI as of 2025, delving into its advancements, applications, and the transformative impact across various industries. Expert Presentation: Our distinguished speaker will provide a comprehensive overview of Generative AI's evolution up to 2025, highlighting key developments and breakthroughs. Case Studies: Examine real-world applications where Generative AI has been successfully im", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Looking into GenAI from 2025 On Friday, 4 April, 2025, from 11 a.m. Event has passed Looking into Generative AI from 2025 Embark on an exploratory journey into the state of Generative AI as of 2025, delving into its advancements, applications, and the transformative impact across various industries.​ 🔹 How It Works: Expert Presentation: Our distinguished speaker will provide a comprehensive overview of Generative AI's evolution up to 2025, highlighting key developments and breakthroughs.​ Case Studies: Examine real-world applications where Generative AI has been successfully implemented, showcasing its versatility and potential.​ Resource Materials: Participants will receive curated materials for further reading and exploration of the topics discussed.​ 🔹 Why Participate? Stay Informed: Gain insights into the latest trends and future directions of Generative AI, keeping you at the forefront of technological innovation.​ Enhance Professional Competence: Understanding the current landscape of Generative AI can provide a competitive edge in various professional fields.​ Certification: All attendees will receive a certificate of participation, acknowledging their commitment to continuous learning in the realm of artificial intelligence. Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 Key Takeaways: Learn & Stay Updated: Gain insights into the latest trends in Generative AI, including advancements in model training, real-world applications, and ethical considerations, keeping you informed about the current state and future directions of this transformative technology.​ Certification: All participants will receive a certificate of completion, acknowledging their commitment to staying abreast of developments in Generative AI.​ Enhance Analytical Skills: Deepen your understanding of Generative AI's impact across various industries, enhancing your ability to critically analyze and apply these concepts in your professional endeavors. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Navigating%20the%20Future:%20AI-ML%20workshop%20for%20Pharma,%20Chemistry,%20Ayurveda,%20and%20Healthcare", "section_title": "IndeedInspiring", "description": "On Saturday, 9 September, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Discover the future of Pharma, Chemistry, Ayurveda, and Healthcare through the lens of Artificial Intelligence and Machine Learning. Explore Cutting-edge AI Applications: Gain insights into how AI and ML are revolutionizing Pharma, Chemistry, Ayurveda, and Healthcare practices. Learn from a Visionary: Our esteemed speaker, Mr. Kushal Sharma, Founder of Indeed Inspiring Infotech, will share his", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare On Saturday, 9 September, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Discover the future of Pharma, Chemistry, Ayurveda, and Healthcare through the lens of Artificial Intelligence and Machine Learning. Areas Covered Explore Cutting-edge AI Applications: Gain insights into how AI and ML are revolutionizing Pharma, Chemistry, Ayurveda, and Healthcare practices. Learn from a Visionary: Our esteemed speaker, Mr. Kushal Sharma, Founder of Indeed Inspiring Infotech, will share his expertise and industry knowledge. Bridge Traditional Wisdom with Modern Tech: Discover the synergy between ancient Ayurvedic practices and modern technological advancements. Unlock Opportunities: Understand the potential of AI and ML in optimizing drug discovery, treatment strategies, and patient care. Network with fellow job seekers and expand your opportunities REGISTRATION CLOSED List of Contents 1. Introduction to AI and Machine Learning (AIML): An overview of what AIML is and its significance in the fields of Pharma, Chemistry, Ayurveda, and Healthcare. 2. Applications of AIML in Healthcare: Use cases where AIML technologies have made an impact in healthcare, such as disease diagnosis, drug discovery, and patient care. 3. AIML in Pharmaceutical Research: Explore how AIML is revolutionizing drug discovery, optimizing clinical trials, and improving the development of pharmaceutical products. 4. AIML in Chemistry: How AIML techniques are being applied in chemical research, including molecular modeling, compound screening, and material discovery. 5. Integration of Ayurveda and AIML: Explore how AI and machine learning can be used to analyze and modernize Ayurvedic practices, including herbal medicine recommendations and patient wellness. 6. Data Collection and Preprocessing: Explain the importance of high-quality data in AIML projects and discuss strategies for data collection and preprocessing, especially in healthcare and pharmaceutical contexts. 7. Machine Learning Algorithms: An overview of popular machine learning algorithms and their suitability for different tasks in Pharma, Chemistry, Ayurveda, and Healthcare. 8. Ethical and Regulatory Considerations: Ethical implications of AIML in healthcare and pharmaceuticals, including patient privacy, bias, and compliance with regulations. 10. Hands-On Workshops and Case Studies: Opportunity to work on hands-on exercises and analyze real-world case studies related to AIML in Pharma, Chemistry, Ayurveda, and Healthcare. 11. Future Trends and Challenges: Discuss emerging trends in AIML and the potential challenges that researchers and practitioners may face in these industries. 12. Networking and Collaboration: Encourage participants to network, share insights, and explore potential collaborations with others in the workshop. 13. Q&A Sessions: Time for participants to ask questions and seek clarification on the workshop content. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Team%20Work%20and%20Public%20Speaking", "section_title": "Server Error (500)", "description": "No meaningful description available.", "text": "Server Error (500) Server Error (500)"}
{"url": "https://indeedinspiring.com/event_page/Applying%20Smart:%20Job%20Application%20Bootcamp", "section_title": "IndeedInspiring", "description": "On Friday, 10 November, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Join Indeed Inspiring Infotech's Free Online Bootcamp: Applying Smart: Job Application Bootcamp Learn how to ace your job applications and increase your chances of landing your dream job. At the end of the bootcamp, participants will receive a certificate of completion, acknowledging their successful participation in the BootCamp Registration is open now! Don't miss this opportunity to boost your", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Applying Smart: Job Application Bootcamp On Friday, 10 November, 2023, from 7 p.m. Event has passed [Recorded] click here to Watch on Youtube Join Indeed Inspiring Infotech's Free Online Bootcamp: Applying Smart: Job Application Bootcamp Learn how to ace your job applications and increase your chances of landing your dream job. Certification: At the end of the bootcamp, participants will receive a certificate of completion, acknowledging their successful participation in the BootCamp Registration is open now! Don't miss this opportunity to boost your career. REGISTRATION CLOSED In this free bootcamp, you will learn: How to write a compelling resume and cover letter How to ace your job interviews How to use social media to your advantage in your job search Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/courses/machine-learning/", "section_title": "IndeedInspiring", "description": "Increasing Demand: Machine learning skills are in high demand across industries. Career Advancement: Machine learning skills can significantly enhance your career prospects Versatility: Machine learning skills are transferable across industries and sectors Who Can Join? Any Graduate Good Aptitude and Reasoning Skills Programming or Stat Experience not required, we teach from basics Graduation or equivalent Different Jobs Available Data Scientist Data Analyst Machine Learning Engineer Deep Learni", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Course Overview Python, Data structures, OOPs, Data preprocessing, Supervised Learning Unsupervised Learning Reinforcement Learning Time series analysis Model evaluation and validation Hyperparameter tuning Why Learn Machine learning? Increasing Demand: Machine learning skills are in high demand across industries. Career Advancement: Machine learning skills can significantly enhance your career prospects Versatility: Machine learning skills are transferable across industries and sectors Who Can Join? Any Graduate Good Aptitude and Reasoning Skills Programming or Stat Experience not required, we teach from basics Graduation or equivalent Different Jobs Available Data Scientist Data Analyst Machine Learning Engineer Deep Learning Engineer Business Analytics Professional Research Analyst Natural Language Processing Specialist Computer Vision Specialist Excel VBA Analyst Database Administrator Analytics Areas/Project Cases Customer Experience Sales Analytics Marketing Analytics Operational Analytics Network Analytics Web Analytics Financial Analytics Stock Market Log Analytics Service Desk, Tickets Analytics HR Analytics Admission Process The Certification Program in Data Science is ideal for students and professionals who are interested in working in the analytics industry and dare keen on enhancing their technical skills with exposure to cutting-edge practices. Eligibility: Any Graduate and Professional Enrollment Form link: https://forms.gle/e2gr6ZwpJ6SQ12YR9 Select Data Science Certification Program Register Here Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/event_page/Forecasting%20and%20Time%20Series%20Analysis%20with%20SAS", "section_title": "IndeedInspiring", "description": "On Saturday, 8 June, 2024, from 8:30 p.m. Event has passed [Recorded] click here to Watch on Youtube Financial analytics with SAS involves using SAS (Statistical Analysis System) software to analyze financial data and derive insights for making informed decisions in the financial domain. SAS offers various tools and capabilities for data management, statistical analysis, predictive modeling, and reporting, making it well-suited for financial analytics tasks. Forecasting and Time Series Analysis", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Forecasting and Time Series Analysis with SAS On Saturday, 8 June, 2024, from 8:30 p.m. Event has passed [Recorded] click here to Watch on Youtube Register today to secure your virtual seat for this enriching event. Financial analytics with SAS involves using SAS (Statistical Analysis System) software to analyze financial data and derive insights for making informed decisions in the financial domain. SAS offers various tools and capabilities for data management, statistical analysis, predictive modeling, and reporting, making it well-suited for financial analytics tasks. Practical Forecasting and Time Series Analysis Additional Perks Hackathon Please Login to Register Scan to Pay ✖ Scan the QR Code with any UPI App and pay. UPI ID: indeedinspiring@icici Total Amount: ₹100 What are we going to cover? Data Management & Financial Reporting: SAS allows efficient management of large financial datasets from various sources, enabling data cleaning, transformation, and integration. It also supports compliance and regulatory reporting, helping financial institutions meet auditing and legal requirements. Additionally, SAS enables the creation of customized financial reports and dashboards for effective data visualization and communication. Descriptive & Predictive Analytics: SAS provides tools for summarizing and visualizing financial data using statistics, histograms, and scatter plots. Advanced predictive analytics techniques, including regression, time series analysis, and machine learning, help forecast financial metrics like stock prices, sales revenue, and risk assessments. Risk Management & Fraud Detection: SAS is widely used for credit risk assessment, market risk analysis, and fraud detection. It offers specialized algorithms for risk modeling, fraud prevention, and real-time identification of suspicious transactions, minimizing financial losses. Portfolio Optimization & Investment Strategies: SAS enables portfolio optimization by constructing investment strategies that balance risk and return. It supports asset allocation, portfolio rebalancing, and performance tracking to maximize financial gains within predefined constraints. Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
{"url": "https://indeedinspiring.com/courses/datascience/", "section_title": "IndeedInspiring", "description": "Covers Machine Learning, Deep Learning, AI & Big Data Working Professional Trainers from Statistics, Big Data and machine learning industrial experience With End to End Live Projects in Different industry, AI Domains Why Learn Data Science? A part of all industries and getting adopted in more areas This has made many of current jobs absolute and opened new job opportunities. Now is the right time to start learning Data Science. Even if you are fresher or working professional, you will be soon wo", "text": "IndeedInspiring Home Services Corporate College/University Individuals Courses Data Science Business Analytics Machine Learning Project Based Training General Aptitude Training Creative thinking and problem solving Events Upcoming Events » Data Fest No upcoming events Past Events » Mapping the Brain with AI Machine Learning Gen AI Full Stack MERN 🔥 Hackathon (Technology & Innovation Challenge) Ideathon 2025 – Innovate, Pitch & Impact! AI in Weather Prediction Investment Trends in AI and Data Startups Resume Building Daily Responsibilities of a DevOps Engineer: Streamlining Development and Operations Team Work and Public Speaking ChatBot Bootcamp How to build 1 person Saas companies in AI Team work and Public Speaking Cryptography and Techniques Effective Java: Code-Level Optimizations for Performance and Maintainability Challenges of 2030 Personality Development and Interview Skills Mobile Application Development Panel Discussion: Data Driven Decision Making in Business Emotional Intelligence Looking into GenAI from 2025 Leadership and Marketing Industry Speaker - Guest Session From Learning to Earning: Azure Data Engineering Career Guide Web Development Bootcamp Data Fest 2025 Quiz Competition Customer Relation and Order Management DevOps: Mastering Hands-On Training for Modern Software Development Hack - The - Need (Amdocs) HR Virtual Meetup: Bridging Talent, Training, and Transformation HR Analytics Forecasting and Time Series Analysis with SAS Mastering Deep Learning with TensorFlow and Keras Quantum AI Workshop Applying Smart: Job Application Bootcamp Business Analyst Workshop AWS Mastery Bootcamp: Level Up Your Cloud Skills SQL Fundamentals Workshop Navigating the Future: AI-ML workshop for Pharma, Chemistry, Ayurveda, and Healthcare Workshop: Craft a compelling resume, master LinkedIn, and boost your career prospects Contact Us About About Us Industry-Academia Collaboration MoUs Activities Payments Join Us Portal Download Brochure Register Here Course Overview Covers Machine Learning, Deep Learning, AI & Big Data Working Professional Trainers from Statistics, Big Data and machine learning industrial experience With End to End Live Projects in Different industry, AI Domains Why Learn Data Science? A part of all industries and getting adopted in more areas This has made many of current jobs absolute and opened new job opportunities. Now is the right time to start learning Data Science. Even if you are fresher or working professional, you will be soon working in project work related to Data Science. It is the most researched and challenging, creative field. And it is stable, better career choice as of today for new jobs. Who Can Join? Any Graduate Good Aptitude and Reasoning Skills Programming or Stat Experience not required, we teach from basics Different Jobs Available Data Scientist Data Analyst Machine Learning Engineer Deep Learning Engineer Business Analytics Professional Research Analyst Natural Language Processing Specialist Computer Vision Specialist Excel VBA Analyst Database Administrator Analytics Areas/Project Cases Customer Experience Sales Analytics Marketing Analytics Operational Analytics Network Analytics Web Analytics Financial Analytics Stock Market Log Analytics Service Desk, Tickets Analytics HR Analytics Admission Process The Certification Program in Data Science is ideal for students and professionals who are interested in working in the analytics industry and dare keen on enhancing their technical skills with exposure to cutting-edge practices. Eligibility: Any Graduate and Professional Enrollment Form link: https://forms.gle/bQwTSTaMMkUjCW2e6 Select Data Science Certification Program Download Brochure Register Here Get connected with us on social networks: Indeed Inspiring Infotech We resource Corporate Trainers on demand. We Impart professsional Trainings in the domains that best fit for the corporates. Products All Courses Data Science program Machine learning Business Analytics Address Indeed Inspiring Infotech Flat No 401 Vrindavan Society, Near Samindradevi Market, BAIF Road, wagoli Pune MH - 412207 Contact info@indeedinspiring.com (+91) 9850113269 (+91) 9850603269 (+91) 9850803269 (+91) 9762203269 © 2024 Copyright: Prushal Technology Pvt. Ltd."}
