{
  "first_aid_manual": [
    {
      "tag": "first_aid_basics",
      "patterns": [
        "What is first aid?",
        "Define first aid",
        "Basics of first aid"
      ],
      "response": [
        "First aid is the first assistance or treatment given to a casualty or sick person for any injury or sudden illness before professional medical care arrives.",
        "The aims of first aid are to preserve life, prevent worsening of medical condition, promote recovery, and ensure safe transportation to healthcare facilities."
      ],
      "follow_up": "Would you like to know about specific first aid techniques?",
      "next_suggestions": ["CPR", "Recovery Position", "Bleeding Control"],
      "related_image_link": ""
    },
    {
      "tag": "cpr_technique",
      "patterns": [
        "How to perform CPR?",
        "Cardiopulmonary resuscitation steps",
        "What to do when someone stops breathing"
      ],
      "response": [
        "For adults: Place hands in center of chest, push hard and fast (100-120 compressions/min). For trained rescuers, give 30 compressions followed by 2 rescue breaths.",
        "For babies under 1 year: Use two fingers for chest compressions (1/3 of chest depth) and cover nose/mouth with your mouth for rescue breaths."
      ],
      "follow_up": "Would you like more details about CPR for different age groups?",
      "next_suggestions": ["Adult CPR", "Child CPR", "Baby CPR"],
      "related_image_link": ""
    },
    {
      "tag": "choking_first_aid",
      "patterns": [
        "What to do when someone is choking?",
        "Heimlich maneuver",
        "First aid for choking"
      ],
      "response": [
        "For adults: Give 5 back blows between shoulder blades, then 5 abdominal thrusts. Repeat until object is dislodged.",
        "For babies under 1: Give 5 back blows followed by 5 chest thrusts using two fingers."
      ],
      "follow_up": "Would you like to know when to seek medical help after choking?",
      "next_suggestions": ["When to call ambulance", "Aftercare for choking", "Preventing choking"],
      "related_image_link": ""
    },
    {
      "tag": "bleeding_control",
      "patterns": [
        "How to stop bleeding?",
        "First aid for wounds",
        "Treating severe bleeding"
      ],
      "response": [
        "Apply direct pressure on wound with clean cloth. Elevate injured part if possible. Don't remove soaked bandages - add more on top.",
        "For severe bleeding: Maintain pressure, use tourniquet only as last resort (note time applied). Seek immediate medical help."
      ],
      "follow_up": "Would you like information about different types of wounds?",
      "next_suggestions": ["Types of wounds", "Signs of infection", "Internal bleeding"],
      "related_image_link": ""
    },
    {
      "tag": "burns_treatment",
      "patterns": [
        "How to treat burns?",
        "First aid for burns",
        "What to do for burn injuries"
      ],
      "response": [
        "Cool burn with running water for 10-20 minutes. Don't use ice. Cover with clean, non-stick dressing. Don't pop blisters.",
        "For chemical burns: Remove contaminated clothing and rinse with plenty of water. For electrical burns: Ensure power is off before approaching."
      ],
      "follow_up": "Would you like to know about different burn degrees?",
      "next_suggestions": ["Burn degrees", "Chemical burns", "When to seek help"],
      "related_image_link": ""
    },
    {
      "tag": "fracture_management",
      "patterns": [
        "How to handle fractures?",
        "First aid for broken bones",
        "Treating fractures"
      ],
      "response": [
        "Immobilize injured area. Support fracture above and below injury. Apply splint if possible. Don't try to realign bones.",
        "For open fractures: Cover wound with sterile dressing but don't push protruding bone back in. Control bleeding first."
      ],
      "follow_up": "Would you like information about specific fracture types?",
      "next_suggestions": ["Arm fractures", "Leg fractures", "Spinal injuries"],
      "related_image_link": ""
    },
    {
      "tag": "shock_management",
      "patterns": [
        "Signs of shock",
        "How to treat shock",
        "First aid for shock"
      ],
      "response": [
        "Signs: Pale/cold skin, rapid pulse, shallow breathing, nausea, dizziness. Lay person down, elevate legs (unless injured), keep warm.",
        "Don't give food/drink. Monitor breathing. Treat cause of shock (bleeding, burns, etc.). Seek immediate medical help."
      ],
      "follow_up": "Would you like to know about different types of shock?",
      "next_suggestions": ["Types of shock", "Internal bleeding", "Severe burns"],
      "related_image_link": ""
    },
    {
      "tag": "poisoning_first_aid",
      "patterns": [
        "What to do for poisoning?",
        "First aid for poisoning",
        "Swallowed poison treatment"
      ],
      "response": [
        "Identify poison if possible. Don't induce vomiting unless instructed. For swallowed poisons: Rinse mouth, give small sips of water if conscious.",
        "For inhaled poisons: Move to fresh air immediately. For skin contact: Remove contaminated clothing, rinse skin with water for 15-20 minutes."
      ],
      "follow_up": "Would you like poison control center information?",
      "next_suggestions": ["Chemical burns", "Snake bites", "Emergency numbers"],
      "related_image_link": ""
    },
    {
      "tag": "first_aid_kit_contents",
      "patterns": [
        "What should be in a first aid kit?",
        "First aid kit essentials",
        "Contents of first aid box"
      ],
      "response": [
        "Basic kit should include: sterile dressings, bandages, adhesive tape, antiseptic wipes, gloves, scissors, tweezers, pain relievers.",
        "Additional items: thermometer, emergency blanket, first aid manual, any personal medications, emergency contact numbers."
      ],
      "follow_up": "Would you like recommendations for specific types of first aid kits?",
      "next_suggestions": ["Home first aid kit", "Car first aid kit", "Workplace first aid kit"],
      "related_image_link": ""
    },
    {
      "tag": "legal_aspects_first_aid",
      "patterns": [
        "Legal aspects of first aid",
        "Good Samaritan law",
        "Duty to provide first aid"
      ],
      "response": [
        "In India, Good Samaritans are protected by law when providing emergency assistance. You can't be held liable for civil/criminal actions when helping in good faith.",
        "Consent is required from conscious adults. For unconscious persons, consent is implied. Always respect privacy and maintain confidentiality."
      ],
      "follow_up": "Would you like more information about first aid provider responsibilities?",
      "next_suggestions": ["Consent in first aid", "Privacy considerations", "Negligence"],
      "related_image_link": ""
    }
  ]
}