[
  {
    "user": "Safety net ka use kis liye hota hai?",
    "bot": "kAryasthaloM meM eka surakShA jAla kA upayoga shramikoM ko UMchAI se saMbaMdhita choToM se bachAne ke lie kiyA jAtA hai| udAharaNa ke lie, isakA upayoga nirmANa sthaloM meM girane vAle shramikoM yA upakaraNoM ko paka.Dane ke lie kiyA jA sakatA hai|\n\nsurakShA Tipa: hameshA sunishchita kareM ki surakShA jAla ThIka se sthApita haiM aura upayoga se pahale nirIkShaNa kie gae haiM| What would you like to focus on — PPE, fall protection systems, or training requirements?"
  },
  {
    "user": "safety net ka use kis liye hota hai?",
    "bot": "Returning to your question, shramikom ko umchai se sambamdhita chotom se bachane ke lie nirmana sthalom mem eka suraksha jala ka upayoga kiya jata hai| hamesha sunishchita karem ki suraksha jala sahi tarike se sthapita haim aura niyamita rupa se nirikshana kie gae haim| suraksha tipa: hamesha upayukta giravata suraksha upakaranom ka upayoga karem| i can also provide tips on how to inspect safety gear before height work, if you'd like?"
  },
  {
    "user": "hi",
    "bot": "Hello! I'm here to help with workplace safety-related questions. Remember, it's important to always follow safety guidelines to ensure a secure working environment. Stay safe!"
  },
  {
    "user": "kya hum working on height ke liye PPEs ke bina ja sakte hai",
    "bot": "kShamA kareM, maiM kevala mere dvArA kie gae surakShA dishAnirdeshoM ke AdhAra para kAryasthala surakShA se saMbaMdhita prashnoM ke sAtha sahAyatA kara sakatA hUM| \n\nhAiTsa para kAma karate samaya vyaktigata surakShA upakaraNa (pIpII) kA upayoga karanA mahatvapUrNa hai| hameshA surakShA hArnesa, hArDa haiTa aura naॉna-slipa phuTaviyara jaise upayukta pIpII kA upayoga kareM| (surakShA Tipa: niyamita rUpa se pahanane aura kShati ke kisI bhI saMketa ke lie apane pIpII kA nirIkShaNa kareM|) What would you like to focus on — PPE, fall protection systems, or training requirements?"
  },
  {
    "user": "kya hum working on height ke liye ppes ke bina ja sakte hai?",
    "bot": "kShamA kareM, maiM kevala mere dvArA kie gae surakShA dishAnirdeshoM ke AdhAra para kAryasthala surakShA se saMbaMdhita prashnoM ke sAtha sahAyatA kara sakatA hUM| \n\nhAiTsa para kAma karate samaya surakShA sunishchita karane ke lie, hameshA upayukta pIpII (vyaktigata surakShA upakaraNa) kA upayoga kareM| isameM hArDa haiTa, sephTI hArnesa aura naॉna-slipa phuTaviyara shAmila ho sakate haiM| (surakShA Tipa: hameshA yaha sunishchita karane ke lie upayoga karane se pahale apane pIpII kA nirIkShaNa kareM ki yaha achChI sthiti meM hai|) What would you like to focus on — PPE, fall protection systems, or training requirements?"
  }
]