[
  {
    "user": "hi",
    "bot": "Hello! I'm infi. How can I help you today?"
  },
  {
    "user": "What is location of indeed inspiring infotech",
    "bot": "Returning to your question, we're glad you're interested in indeed inspiring infotech's location! while we can't provide the exact street address here, we can share that our office is based in the vibrant city of . if you're interested in visiting our office or learning about our working hours, we'd be happy to provide more details. would that be helpful for you? we can also share more contact information if you'd like. i could also share some interesting facts about peepal trees if you'd like?"
  },
  {
    "user": "What is location of indeed inspiring infotech",
    "bot": "Returning to your question, we're glad you're interested in indeed inspiring infotech's location! while we can't provide the exact street address here, we can share that our office is based in the vibrant city of noida in india. this location allows us to be at the heart of a thriving tech hub, giving us access to a wealth of talent and resources.\n\nif you're interested in visiting our office or learning about our working hours, we'd be. would you like details about any specific region we work in?"
  },
  {
    "user": "What is location of indeed inspiring infotech",
    "bot": "Returning to your question, we're glad you're interested in indeed inspiring infotech's location! while we can't provide the exact street address here, we can share that our office is based in the vibrant city of noida, in the northern indian state of uttar pradesh. noida is a significant hub for the country's it and software services sector.\n\nif you're interested in visiting our office or learning about our working hours, we'd. would you like details about any specific region we work in?"
  },
  {
    "user": "What is location of indeed inspiring infotech",
    "bot": "Returning to your question, we are located in flat no 401, vrindavan society, near samindradevi market, baif road, wagholi, pune mh - 412207. our office is situated in wagholi, pune, maharashtra, making it convenient for students and professionals to reach us. if you're interested in visiting our office or learning about our working hours, feel free to ask! we'. i could also share some interesting facts about peepal trees if you'd like?"
  }
]