
[
  {
    "id": 1,
    "en_patterns": [
      "nirankari.*mission",
      "sant.*nirankari.*mission",
      "about.*nirankari",
      "founder.*nirankari",
      "history.*nirankari",
      "background.*mission",
      "what.*nirankari"
    ],
    "hi_patterns": [
      "संत.*निरंकारी.*मिशन",
      "निरंकारी.*मिशन.*बारे.*में",
      "मिशन.*स्थापना",
      "मिशन.*इतिहास",
      "कब.*शुरू.*मिशन",
      "मिशन.*उद्देश्य",
      "निरंकारी"
    ],
    "en_answer": "The Sant Nirankari Mission is a spiritual organization founded in 1929 by Baba Buta Singh Ji Mahraj, that aims to promote universal brotherhood and peace by helping people realize God through the guidance of a living Satguru. The mission has grown into a global organisation under the divine leadership of successive spiritual guides (Sadguru), including Shehanshah Baba Avtar Singh Ji, Baba Gurubachan Singh Ji, Baba Hardev Singh Ji, Mata Savinder Ji, and now Sadguru Mata Sudiksha Ji Mahraj.",
    "hi_answer": "संत निरंकारी मिशन एक आध्यात्मिक संगठन है जिसकी स्थापना 1929 में बाबा बूटा सिंह जी महाराज ने की थी। इसका उद्देश्य है – मानवता में भाईचारा, प्रेम और शांति को बढ़ावा देना और सतगुरु की कृपा से ईश्वर का साक्षात्कार कराना। यह मिशन शहंशाह बाबा अवतार सिंह जी, बाबा गुरबचन सिंह जी, बाबा हरदेव सिंह जी, माता सविंदर जी और अब सतगुरु माता सुदीक्षा जी महाराज जैसे सतगुरुओं के दिव्य नेतृत्व में एक वैश्विक संगठन बन चुका है।"
  },
  {
    "id": 2,
    "en_patterns": [
      "main.*message.*nirankari",
      "core.*values.*nirankari",
      "what.*mission.*teach",
      "belief.*nirankari",
      "teach.*nirankari",
      "values.*mission",
      "message.*nirankari",
      "sant.*nirankari.*mission.*(teaches|values|belief|message)?"
    ],
    "hi_patterns": [
      "संत.*निरंकारी.*मिशन.*मुख्य.*संदेश",
      "मुख्य.*मंत्र.*निरंकारी",
      "क्या.*सिखाता.*मिशन",
      "मूल.*मूल्य.*मिशन",
      "निरंकारी.*मिशन.*आस्था",
      "मिशन.*शिक्षण",
      "सिखाता.*निरंकारी",
      "मूल्य.*निरंकारी"
    ],
    "en_answer": "The mission teaches that God is formless and omnipresent, and every human being can experience God-realisation in their lifetime through the Satguru’s grace. Its core values are love, humility, unity, and service.",
    "hi_answer": "यह मिशन सिखाता है कि ईश्वर निराकार और सर्वव्यापी हैं, और हर व्यक्ति सतगुरु की कृपा से अपने जीवन में ईश्वर की अनुभूति कर सकता है। इसके मूल मूल्य प्रेम, विनम्रता, एकता और सेवा हैं।"
  }

,
  {
    "id": 3,
    "en_patterns": [
      "current.*leader.*nirankari",
      "present.*spiritual.*head.*nirankari",
      "who.*leader.*nirankari",
      "who.*satguru.*nirankari",
      "name.*satguru.*nirankari",
      "spiritual.*guide.*nirankari"
    ],
    "hi_patterns": [
      "वर्तमान.*आध्यात्मिक.*प्रमुख.*निरंकारी",
      "संत.*निरंकारी.*गुरु.*कौन.*है",
      "कौन.*नेता.*निरंकारी",
      "नेतृत्व.*देता.*निरंकारी",
      "आध्यात्मिक.*गुरु.*का.*नाम",
      "संत.*निरंकारी.*प्रमुख"
    ],
    "en_answer": "As of now, the spiritual head is Satguru Mata Sudiksha Ji Maharaj. Mata Sudiksha Ji has been continuously motivating and guiding the devotees, especially the youth towards a righteous, disciplined and meaningful path. She believes and preaches that Knowing God is the only way to lead a balanced and blissful life.",
    "hi_answer": "वर्तमान में आध्यात्मिक प्रमुख सतगुरु माता सुदीक्षा जी महाराज हैं। माता सुदीक्षा जी निरंतर भक्तों, विशेष रूप से युवाओं को धर्मपरायण, अनुशासित और सार्थक मार्ग की ओर प्रेरित और मार्गदर्शन कर रही हैं। उनका मानना है और वे प्रचार करती हैं कि ईश्वर को जानना ही संतुलित और आनंदमय जीवन जीने का एकमात्र मार्ग है।"
  },
  {
    "id": 4,
    "en_patterns": [
      "god.*realisation",
      "what.*god.*realisation",
      "explain.*god.*realisation",
      "god.*realisation.*nirankari",
      "nirankari.*god.*realisation",
      "meaning.*god.*realisation",
      "definition.*god.*realisation"
    ],
    "hi_patterns": [
      "ईश्वर.*अनुभूति",
      "ईश्वर.*अनुभव",
      "ईश्वर.*अनुभूति.*क्या.*है",
      "निरंकारी.*ईश्वर.*अनुभूति",
      "ब्रह्मज्ञान.*ईश्वर.*अनुभव",
      "ईश्वर.*को.*कैसे.*जाना"
    ],
    "en_answer": "God-Realisation means experiencing and becoming aware of the formless God (Nirankar) within and around us. This is made possible by the Satguru during a spiritual revelation (Brahmgyan).",
    "hi_answer": "ईश्वर अनुभूति का अर्थ है निराकार ईश्वर (निरंकार) का अपने भीतर और आस-पास अनुभव करना और उसकी जागरूकता प्राप्त करना। यह सतगुरु द्वारा आध्यात्मिक रहस्योद्घाटन (ब्रह्मज्ञान) के समय संभव होता है।"
  },
  {
    "id": 5,
    "en_patterns": [
      "role.*satguru.*nirankari",
      "satguru.*role.*nirankari",
      "who.*satguru.*nirankari",
      "what.*satguru.*does.*nirankari",
      "satguru.*nirankari",
      "satguru.*does.*mission"
    ],
    "hi_patterns": [
      "सतगुरु.*भूमिका.*निरंकारी",
      "संत.*निरंकारी.*सतगुरु.*कौन",
      "सतगुरु.*क्या.*करते.*हैं",
      "सतगुरु.*कार्य.*निरंकारी",
      "सतगुरु.*निरंकारी.*मिशन",
      "भूमिका.*सतगुरु"
    ],
    "en_answer": "The Satguru is the enlightened master who grants God-knowledge and guides followers on how to live a truthful and spiritual life filled with love, service, and devotion.",
    "hi_answer": "सतगुरु एक जाग्रत गुरु होते हैं जो ईश्वर-ज्ञान प्रदान करते हैं और अनुयायियों को प्रेम, सेवा और भक्ति से पूर्ण सच्चे एवं आध्यात्मिक जीवन जीने का मार्ग दिखाते हैं।"
  }
,
 {
    "id": 6,
    "en_patterns": [
      "key.*practices.*nirankari",
      "main.*practices.*nirankari",
      "mission.*emphasize.*practices",
      "list.*practices.*nirankari",
      "nirankari.*practices",
      "main.*teachings.*nirankari",
      "main.*values.*nirankari"
    ],
    "hi_patterns": [
      "निरंकारी.*मुख्य.*प्रथाएं",
      "निरंकारी.*मुख्य.*अभ्यास",
      "मिशन.*प्रमुख.*अभ्यास",
      "निरंकारी.*अभ्यास.*कौन.*से",
      "निरंकारी.*सेवा.*स्मरण.*सत्संग",
      "मिशन.*सिखाता.*है"
    ],
    "en_answer": "The mission emphasizes three main practices:\n• Sewa (selfless service)\n• Simran (constant remembrance of Nirankar)\n• Satsang (attending spiritual gatherings for growth and unity)",
    "hi_answer": "मिशन तीन मुख्य अभ्यसों पर ज़ोर देता है:\n• सेवा (निःस्वार्थ सेवा)\n• स्मरण (निरंकार का निरंतर स्मरण)\n• सत्संग (आध्यात्मिक सभाओं में भाग लेना जो विकास और एकता के लिए हैं)"
  },
  {
    "id": 7,
    "en_patterns": [
      "nirankari.*religion",
      "is.*nirankari.*religion",
      "what.*religion.*nirankari",
      "which.*religion.*mission.*follow",
      "does.*mission.*follow.*religion",
      "religion.*followed.*nirankari",
      "nirankari.*religion.*belong"
    ],
    "hi_patterns": [
      "निरंकारी.*किसी.*धर्म.*का.*अनुसरण",
      "निरंकारी.*धर्म.*है",
      "निरंकारी.*कौन.*धर्म",
      "निरंकारी.*धार्मिक.*पक्ष",
      "मिशन.*धर्म.*क्या.*है",
      "निरंकारी.*धार्मिक.*संगठन"
    ],
    "en_answer": "No. Sant Nirankari Mission is a spiritual ideology which believes God is one formless Nirankar and can be realized with grace of Sadguru. The mission respects all religions. It focuses on spirituality and humanity, encouraging people of all backgrounds to come together in peace.",
    "hi_answer": "नहीं। संत निरंकारी मिशन एक आध्यात्मिक विचारधारा है जो मानती है कि ईश्वर एक निराकार निरंकार है और सतगुरु की कृपा से इसका अनुभव किया जा सकता है। मिशन सभी धर्मों का सम्मान करता है। यह आध्यात्मिकता और मानवता पर ध्यान केंद्रित करता है और सभी पृष्ठभूमि के लोगों को शांति में एक साथ आने के लिए प्रोत्साहित करता है।"
  },
  {
    "id": 8,
    "en_patterns": [
      "purpose.*satsang",
      "satsang.*mean",
      "satsang.*do",
      "satsang.*teach",
      "why.*attend.*satsang",
      "satsang.*nirankari",
      "importance.*satsang",
      "definition.*satsang",
      "meaning.*satsang"
    ],
    "hi_patterns": [
      "सत्संग.*उद्देश्य",
      "सत्संग.*मतलब",
      "सत्संग.*महत्त्व",
      "सत्संग.*क्यों.*जाते",
      "निरंकारी.*सत्संग",
      "सत्संग.*परिभाषा"
    ],
    "en_answer": "Satsang is a spiritual congregation where followers come together to listen to discourses, sing devotional hymns, and strengthen their connection with God.",
    "hi_answer": "सत्संग एक आध्यात्मिक सभा है जहाँ अनुयायी एकत्र होते हैं, प्रवचन सुनते हैं, भक्ति गीत गाते हैं, और ईश्वर के साथ अपने संबंध को मजबूत करते हैं।"
  },
  {
    "id": 9,
    "en_patterns": [
      "social.*work.*nirankari",
      "community.*services.*nirankari",
      "social.*initiatives.*mission",
      "activities.*nirankari",
      "mission.*help.*society",
      "community.*projects.*mission",
      "social.*service.*foundation"
    ],
    "hi_patterns": [
      "निरंकारी.*सामाजिक.*कार्य",
      "मिशन.*सामाजिक.*सेवा",
      "निरंकारी.*कार्य.*द्वारा",
      "मिशन.*सामुदायिक.*सेवा",
      "सामाजिक.*कार्य.*निरंकारी"
    ],
    "en_answer": "The mission organizes blood donation drives, tree plantation, cleanliness campaigns, disaster relief, health camps, and youth development programs. The Sant Nirankari Charitable Foundation is the social wing of Sant Nirankari Mission.",
    "hi_answer": "मिशन रक्तदान शिविर, वृक्षारोपण, स्वच्छता अभियान, आपदा राहत, स्वास्थ्य शिविर और युवा विकास कार्यक्रमों का आयोजन करता है। संत निरंकारी चैरिटेबल फाउंडेशन मिशन की सामाजिक शाखा है।"
  },
  {
    "id": 10,
    "en_patterns": [
      "what.*nirankar",
      "meaning.*nirankar",
      "who.*nirankar",
      "define.*nirankar",
      "nirankar.*means",
      "nirankar.*stands.*for",
      "explain.*nirankar"
    ],
    "hi_patterns": [
      "निरंकार.*मतलब",
      "निरंकार.*अर्थ",
      "निरंकार.*कौन.*है",
      "निरंकार.*व्याख्या",
      "निरंकार.*शब्द.*अर्थ"
    ],
    "en_answer": "“Nirankar” means formless God—the eternal, omnipresent divine power that cannot be seen with physical eyes but can be experienced through divine knowledge (Brahmgyan) granted by the Satguru.",
    "hi_answer": "“निरंकार” का मतलब है निराकार ईश्वर — शाश्वत, सर्वव्यापी दिव्य शक्ति जिसे भौतिक आँखों से नहीं देखा जा सकता, लेकिन सतगुरु द्वारा प्रदान किए गए ब्रह्मज्ञान के माध्यम से अनुभव किया जा सकता है।"
  }
,
{
    "id": 11,
    "en_patterns": [
      "brahmgyan",
      "god knowledge",
      "meaning.*brahmgyan",
      "define.*brahmgyan",
      "explain.*brahmgyan",
      "spiritual.*god"
    ],
    "hi_patterns": [
      "ब्र(ा|ा)ह्मज्ञान",
      "ईश्वर.*ज्ञान",
      "ब्रह्मज्ञान.*अर्थ",
      "ब्रह्मज्ञान.*परिभाषा",
      "ब्रह्मज्ञान.*व्याख्या"
    ],
    "en_answer": "Brahmgyan is the realisation of the formless God that is given directly by the Satguru.",
    "hi_answer": "ब्राह्मज्ञान वह अनुभव है जिसमें निराकार ईश्वर की अनुभूति सीधे सतगुरु द्वारा दी जाती है।"
  },
  {
    "id": 12,
    "en_patterns": [
      "nirankari.*daily.*life",
      "mission.*help.*life",
      "benefits.*nirankari",
      "impact.*mission",
      "importance.*nirankari",
      "teachings.*nirankari"
    ],
    "hi_patterns": [
      "निरंकारी.*जीवन",
      "मिशन.*जीवन.*प्रभाव",
      "शिक्षा.*लाभ",
      "महत्व.*निरंकारी",
      "मिशन.*मदद"
    ],
    "en_answer": "The teachings help individuals to live a peaceful, ego-free, and balanced life. They encourage forgiveness, self-discipline, positive thinking, and service to others, which improves personal and social life.",
    "hi_answer": "शिक्षाएँ व्यक्तियों को शांति, अहंकारमुक्त और संतुलित जीवन जीने में मदद करती हैं। ये क्षमा, आत्म-अनुशासन, सकारात्मक सोच और दूसरों की सेवा को बढ़ावा देती हैं, जिससे व्यक्तिगत और सामाजिक जीवन में सुधार होता है।"
  },
  {
    "id": 13,
    "en_patterns": [
      "youth.*nirankari",
      "role.*youth",
      "youth.*mission",
      "mission.*youth",
      "youth.*involvement",
      "youth.*activities"
    ],
    "hi_patterns": [
      "युवा.*मिशन",
      "युवा.*भूमिका",
      "निरंकारी.*युवा",
      "मिशन.*युवा.*संलग्नता",
      "युवा.*गतिविधि"
    ],
    "en_answer": "Youth are seen as the future of the Mission and society. Special platforms like Nirankari Youth Symposiums and Sewadal Training are organized to engage youth in spirituality and selfless service.",
    "hi_answer": "युवा मिशन और समाज का भविष्य माने जाते हैं। निरंकारी यूथ सिम्पोजियम और सेवादल प्रशिक्षण जैसे विशेष मंच युवाओं को आध्यात्मिकता और निःस्वार्थ सेवा में संलग्न करने के लिए आयोजित किए जाते हैं।"
  }
,
  {
    "id": 14,
    "en_patterns": [
      "nirankari.*sewadal",
      "what.*sewadal",
      "role.*sewadal",
      "volunteers.*nirankari",
      "nirankari.*volunteers",
      "who.*volunteers.*nirankari",
      "define.*sewadal"
    ],
    "hi_patterns": [
      "निरंकारी.*सेवादल",
      "सेवादल.*भूमिका",
      "सेवादल.*परिभाषित",
      "स्वयंसेवक.*निरंकारी"
    ],
    "en_answer": "The Sant Nirankari Sewadal (SNSD) is a disciplined group of volunteers of the Sant Nirankari Mission dedicated to the selfless service of the humankind. These volunteers come from different backgrounds of the society. It was established in 1956 by Baba Avtar Singh ji and includes a women's wing led by Nirankari Rajmata ji. Sewadal volunteers tirelessly work throughout the year with the blessings of Satguru, playing a crucial role in managing spiritual congregations, events, and philanthropic activities.",
    "hi_answer": "संत निरंकारी सेवादल (SNSD) संत निरंकारी मिशन के अनुशासित स्वयंसेवकों का समूह है जो निःस्वार्थ सेवा के लिए समर्पित हैं। ये स्वयंसेवक समाज के विभिन्न पृष्ठभूमि से आते हैं। इसकी स्थापना 1956 में बाबा अवतार सिंह जी ने की थी और इसमें निरंकारी राजमाता जी के नेतृत्व में महिला विंग भी शामिल है। सेवादल स्वयंसेवक सतगुरु के आशीर्वाद से पूरे वर्ष कठिन परिश्रम करते हैं, आध्यात्मिक सभा, कार्यक्रम और सामाजिक गतिविधियों के संचालन में महत्वपूर्ण भूमिका निभाते हैं।"
  },
  {
    "id": 15,
    "en_patterns": [
      "nirankari.*samagam",
      "what.*samagam",
      "define.*samagam",
      "purpose.*samagam",
      "happens.*samagam",
      "samagam.*nirankari"
    ],
    "hi_patterns": [
      "निरंकारी.*समागम",
      "समागम.*क्या.*है",
      "समागम.*उद्देश्य",
      "समागम.*होता.*है"
    ],
    "en_answer": "The gathering of Mission’s devotees in large numbers periodically to celebrate the essence of enlightenment; also intending to share it with other brothers and sisters across the world is what we know as Samagam. Nirankari Samagams are synonymous with selfless service, discipline, togetherness, and spiritual discourse, creating a blissful festival of brotherhood. The presence of Satguru at the Samagams makes it a divine celebration where devotees receive the ‘Darshan’ (audience) of their master.",
    "hi_answer": "समय-समय पर मिशन के भक्तों का एकत्रित होना, जहाँ वे प्रबोधन के सार का उत्सव मनाते हैं और इसे विश्वभर के भाइयों-बहनों के साथ साझा करते हैं, उसे समागम कहते हैं। निरंकारी समागम निःस्वार्थ सेवा, अनुशासन, एकजुटता और आध्यात्मिक प्रवचन का पर्याय हैं, जो भाईचारे का आनंदमय उत्सव बनाते हैं। समागम में सतगुरु की उपस्थिति इसे दिव्य उत्सव बनाती है जहाँ भक्त अपने गुरु के दर्शन प्राप्त करते हैं।"
  },

{
    "id": 16,
    "en_patterns": [
      "how.*join.*(sant\\s+)?nirankari.*mission",
      "joining.*process.*(nirankari|mission)",
      "how.*become.*member.*(nirankari|mission)",
      "steps.*join.*nirankari",
      "join.*nirankari.*mission"
    ],
    "hi_patterns": [
      "कैसे.*जुड़.*(संत\\s+)?निरंकारी.*मिशन",
      "निरंकारी.*में.*शामिल.*होने.*की.*प्रक्रिया",
      "निरंकारी.*का.*सदस्य.*कैसे.*बनें",
      "निरंकारी.*में.*कैसे.*जुड़ें"
    ],
    "en_answer": "Anyone can join by attending Satsang gatherings, meeting a Gyan Pracharak, and receiving Brahmgyan from the Satguru’s representative.",
    "hi_answer": "कोई भी व्यक्ति सत्संग सम्मेलनों में भाग लेकर, ज्ञान प्रचारक से मिलकर और सतगुरु के प्रतिनिधि से ब्रह्मज्ञान प्राप्त करके मिशन से जुड़ सकता है।"
  },
  {
    "id": 17,
    "en_patterns": [
      "does.*mission.*encourage.*education",
      "nirankari.*mission.*view.*education",
      "support.*career.*growth.*nirankari",
      "education.*importance.*nirankari",
      "career.*nirankari.*mission"
    ],
    "hi_patterns": [
      "क्या.*मिशन.*शिक्षा.*और.*करियर.*को.*प्रोत्साहित.*करता",
      "निरंकारी.*मिशन.*शिक्षा.*पर.*दृष्टि",
      "क्या.*निरंकारी.*करियर.*विकास.*समर्थन",
      "शिक्षा.*महत्व.*निरंकारी"
    ],
    "en_answer": "Absolutely. The Mission believes in balancing spiritual and worldly responsibilities. It encourages followers to study, work honestly, and succeed in life while staying grounded in values.",
    "hi_answer": "बिल्कुल। मिशन आध्यात्मिक और सांसारिक जिम्मेदारियों के संतुलन में विश्वास करता है। यह अनुयायियों को अध्ययन करने, ईमानदारी से काम करने और जीवन में सफलता पाने के साथ-साथ मूल्यों में बने रहने के लिए प्रोत्साहित करता है।"
  },
  {
    "id": 18,
    "en_patterns": [
      "what.*is.*sant.*nirankari.*charitable.*foundation",
      "define.*sncf",
      "role.*sant.*nirankari.*charitable.*foundation",
      "purpose.*sncf"
    ],
    "hi_patterns": [
      "संत.*निरंकारी.*चैरिटेबल.*फाउंडेशन.*क्या.*है",
      "एस\\s?एन\\s?सी\\s?एफ.*परिभाषित",
      "संत.*निरंकारी.*चैरिटेबल.*फाउंडेशन.*भूमिका",
      "एस\\s?एन\\s?सी\\s?एफ.*उद्देश्य"
    ],
    "en_answer": "The Sant Nirankari Charitable Foundation (SNCF) goes beyond just charity. Founded in 2010 to implement the vision of Nirankari Baba Ji, SNCF focuses on social responsibility, environmental initiatives, and healthcare programs, spreading kindness and building a better society.",
    "hi_answer": "संत निरंकारी चैरिटेबल फाउंडेशन (SNCF) केवल धर्मार्थ कार्यों से आगे बढ़कर समाजिक जिम्मेदारी, पर्यावरणीय पहलों, और स्वास्थ्य सेवा कार्यक्रमों पर ध्यान केंद्रित करता है। इसकी स्थापना 2010 में निरंकारी बाबा जी के दृष्टिकोण को लागू करने के लिए की गई थी, जो दया फैलाने और बेहतर समाज बनाने का काम करता है।"
  },
  {
    "id": 19,
    "en_patterns": [
      "core.*values.*sant.*nirankari.*charitable.*foundation",
      "principles.*sncf",
      "main.*values.*sncf",
      "sncf.*key.*values"
    ],
    "hi_patterns": [
      "संत.*निरंकारी.*चैरिटेबल.*फाउंडेशन.*मुख्य.*मूल्य",
      "एस\\s?एन\\s?सी\\s?एफ.*सिद्धांत",
      "एस\\s?एन\\s?सी\\s?एफ.*कोर.*वैल्यूज़",
      "संत.*निरंकारी.*चैरिटेबल.*मूल्य"
    ],
    "en_answer": "Heal, Enrich & Empower are three core values of SNCF: HEAL (Health) improving healthcare access; ENRICH (Education) empowering through education; EMPOWER (Upliftment) fostering self-reliance and supporting disaster relief, elder care, and services for individuals with disabilities.",
    "hi_answer": "SNCF के तीन मुख्य मूल्य हैं: उपचार (स्वास्थ्य) स्वास्थ्य सेवाओं में सुधार; समृद्धि (शिक्षा) शिक्षा के माध्यम से सशक्तिकरण; और सशक्त करना (उन्नति) आत्मनिर्भरता को बढ़ावा देना तथा आपदा राहत, वृद्ध देखभाल और विकलांग व्यक्तियों के लिए सेवाओं का समर्थन करना।"
  },
  {
    "id": 20,
    "en_patterns": [
      "spiritual.*texts.*nirankari.*mission",
      "important.*books.*nirankari",
      "define.*spiritual.*texts.*nirankari",
      "nirankari.*holy.*books"
    ],
    "hi_patterns": [
      "निरंकारी.*आध्यात्मिक.*ग्रंथ",
      "निरंकारी.*महत्वपूर्ण.*किताबें",
      "आध्यात्मिक.*ग्रंथ.*निरंकारी",
      "निरंकारी.*पवित्र.*ग्रंथ"
    ],
    "en_answer": "The two spiritual texts of the Mission are Sampurna Avtar Bani & Sampurna Hardev Bani, which guide and enlighten the human mind towards salvation and righteousness.",
    "hi_answer": "मिशन के दो आध्यात्मिक ग्रंथ हैं: सम्पूर्ण अवतार बानी और सम्पूर्ण हरदेव बानी, जो मानव मन को मुक्ति और धार्मिकता की ओर मार्गदर्शन और प्रकाशमान करते हैं।"
  },
  {
    "id": 21,
    "en_patterns": [
      "what.*is.*sampurna.*avtar.*bani",
      "define.*sampurna.*avtar.*bani",
      "contents.*sampurna.*avtar.*bani"
    ],
    "hi_patterns": [
      "सम्पूर्ण.*अवतार.*बानी.*क्या.*है",
      "सम्पूर्ण.*अवतार.*बानी.*परिभाषित",
      "सम्पूर्ण.*अवतार.*बानी.*सामग्री"
    ],
    "en_answer": "Scripted and blessed by Baba Avtar Singh Ji, Sampurna Avtar Bani is a collection of 376 pious verses that guide seekers from oblivion to oneness. Originally in Punjabi, it has been translated into many languages including English, Hindi, Marathi, Gujarati, and Bengali.",
    "hi_answer": "बाबा अवतार सिंह जी द्वारा लिखित और आशीर्वादित, सम्पूर्ण अवतार बानी 376 पवित्र छंदों का संग्रह है जो साधकों को विस्मृति से एकत्व की ओर मार्गदर्शन करता है। मूलतः पंजाबी में है, इसे अंग्रेजी, हिंदी, मराठी, गुजराती और बंगाली सहित कई भाषाओं में अनुवादित किया गया है।"
  },
  {
    "id": 22,
    "en_patterns": [
      "what.*is.*sampurna.*hardev.*bani",
      "define.*sampurna.*hardev.*bani",
      "contents.*sampurna.*hardev.*bani"
    ],
    "hi_patterns": [
      "सम्पूर्ण.*हरदेव.*बानी.*क्या.*है",
      "सम्पूर्ण.*हरदेव.*बानी.*परिभाषित",
      "सम्पूर्ण.*हरदेव.*बानी.*सामग्री"
    ],
    "en_answer": "A gift of Baba Hardev Singh Ji, Sampurna Hardev Bani is a collection of 301 sacred verses addressing contemporary issues, explaining spiritual wisdom through his discourses.",
    "hi_answer": "बाबा हरदेव सिंह जी का उपहार, सम्पूर्ण हरदेव बानी 301 पवित्र छंदों का संग्रह है जो समकालीन मुद्दों को संबोधित करता है और उनके प्रवचनों के माध्यम से आध्यात्मिक ज्ञान समझाता है।"
  },
  {
    "id": 23,
    "en_patterns": [
      "magazines.*literature.*nirankari",
      "books.*publications.*nirankari",
      "define.*nirankari.*magazines",
      "nirankari.*literature"
    ],
    "hi_patterns": [
      "निरंकारी.*पत्रिकाएँ.*साहित्य",
      "निरंकारी.*किताबें.*प्रकाशन",
      "निरंकारी.*पत्रिका.*परिभाषित",
      "निरंकारी.*साहित्य"
    ],
    "en_answer": "Ek Nazar, Sant Nirankari, Hansti Duniya are regular magazines published in many languages. Nirankari Publication has released numerous books covering the Mission’s history, ideology, activities, and spiritual and social topics.",
    "hi_answer": "एक नजर, संत निरंकारी, हंसती दुनिया कई भाषाओं में प्रकाशित नियमित पत्रिकाएँ हैं। निरंकारी प्रकाशन ने मिशन के इतिहास, विचारधारा, गतिविधियों, और आध्यात्मिक व सामाजिक विषयों पर अनेक पुस्तकें प्रकाशित की हैं।"
  },
  {
    "id": 24,
    "en_patterns": [
      "five.*tenets.*nirankari",
      "five.*principles.*nirankari.*mission",
      "pledges.*nirankari",
      "nirankari.*five.*pledges"
    ],
    "hi_patterns": [
      "निरंकारी.*पाँच.*सिद्धांत",
      "निरंकारी.*पाँच.*मूल.*सिद्धांत",
      "निरंकारी.*प्रतिज्ञाएँ",
      "निरंकारी.*पाँच.*प्रतिज्ञाएँ"
    ],
    "en_answer": "The five pledges are:\n1. Use body, mind, and possessions as blessings without ego.\n2. No ego or vanity due to caste, creed, or race.\n3. No discrimination or hatred due to food, dress, or lifestyle.\n4. Fulfill family and societal responsibilities.\n5. Do not divulge God Knowledge without the Master’s consent.",
    "hi_answer": "पाँच प्रतिज्ञाएँ हैं:\n1. शरीर, मन और संपत्ति को अहंकार से मुक्त आशीर्वाद मानना।\n2. जाति, धर्म या रंग के कारण अहंकार या घमंड न करना।\n3. भोजन, पहनावे या जीवनशैली के आधार पर भेदभाव या द्वेष न करना।\n4. परिवार और समाज की जिम्मेदारियों को पूरा करना।\n5. गुरु की अनुमति के बिना ईश्वर का ज्ञान प्रकट न करना।"
  },
{
    "id": 25,
    "en_patterns": [
      "seven.*stars.*nirankari",
      "define.*seven.*stars.*nirankari",
      "who.*seven.*stars",
      "nirankari.*seven.*stars"
    ],
    "hi_patterns": [
      "निरंकारी.*सात.*सितारे",
      "सात.*सितारों.*परिभाषित",
      "सात.*सितारे.*कौन.*थे",
      "निरंकारी.*सात.*सितारे.*कौन"
    ],
    "en_answer": "The Seven Stars were the first Executive Committee members of the Sant Nirankari Mandal formed in 1948: President Shri Labh Singh Ji, Vice-President Dr. Des Raj Ji, Secretary Shri Ram Saran Ji, Vice-Secretary Babu Mahadev Singh Ji, Publication In-charge Shri Santokh Singh Ji, Treasurer Shri Jugal Kishore Ji (Kabir Ji), and Langar In-charge Shri Bhagat Ramchandar Ji.",
    "hi_answer": "सात सितारे 1948 में गठित संत निरंकारी मंडल के पहले कार्यकारी समिति सदस्य थे: अध्यक्ष श्री लाभ सिंह जी, उपाध्यक्ष डॉ. देस राज जी, सचिव श्री राम सरन जी, उप-सचिव बाबू महादेव सिंह जी, प्रकाशन प्रभारी श्री संतोख सिंह जी, कोषाध्यक्ष श्री जुगल किशोर जी (कबीर जी), और लंगर प्रभारी श्री भगत रामचंदर जी।"
  },
  {
    "id": 26,
    "en_patterns": [
      "what.*is.*being.*nirankari",
      "meaning.*of.*nirankari",
      "define.*nirankari",
      "nirankari.*meaning"
    ],
    "hi_patterns": [
      "निरंकारी.*क्या.*है",
      "निरंकारी.*अर्थ.*क्या.*है",
      "निरंकारी.*परिभाषित",
      "निरंकारी.*मतलब"
    ],
    "en_answer": "Being Nirankari means being endowed with spiritual truth and awareness of the eternal, formless God by the grace of Satguru. The relationship with Nirankar is of mindful remembrance expressed through the three lines of Simran.",
    "hi_answer": "निरंकारी होना मतलब सतगुरु की कृपा से आध्यात्मिक सत्य और शाश्वत निराकार ईश्वर की जागरूकता से सम्पन्न होना है। निरंकार से संबंध सतत स्मरण का है जो तीन सरल सिमरन के माध्यम से व्यक्त किया जाता है।"
  },
  {
  "id": 27,
  "en_patterns": [
    "what.*is.*simran",
    "define.*simran",
    "meaning.*of.*simran",
    "lines.*of.*simran",
    "explain.*simran",
    "simran.*meaning",
    "simran.*definition",
    "simran.*remembrance",
    "what.*does.*simran.*mean",
    "tell.*me.*about.*simran",
    "simran.*in.*nirankari",
    "simran.*remembrance.*god"
  ],
  "hi_patterns": [
    "सिमरन.*क्या.*है",
    "सिमरन.*परिभाषित",
    
    "सिमरन.*मतलब",
    "सिमरन.*अर्थ",
    "सिमरन.*लाइनें",
    "सिमरन.*समझाओ",
    "सिमरन.*ध्यान",
    "सिमरन.*याद.*रखना",
    "सिमरन.*निरंकारी",
    "सिमरन.*अल्माइटी.*गॉड",
    "सिमरन.*अर्थ.*क्या.*है",
    "सिमरन.*का.*मतलब",
    "सिमरन.*के.*बारे.*में.*बताओ",
    "सिमरन.*ध्यान.*क्या.*है"
  ],
  "en_answer": "“Tu Hi Nirankar” (Only YOU are the Formless Almighty God)\n“Main Teri Sharan Haan” (I completely surrender unto YOU)\n“Mainu Baksh Lo” (Forgive all my sins)",
  "hi_answer": "“तू ही निरंकार” (केवल आप ही निराकार सर्वशक्तिमान ईश्वर हैं)\n“मैं तेरी शरण हूँ” (मैं पूरी तरह से आपकी शरण में हूँ)\n“मैनू बख्श लो” (मेरे सारे पाप माफ़ करो)"
}
,
  {
    "id": 28,
    "en_patterns": [
      "different.*samagams",
      "define.*samagams",
      "names.*nirankari.*samagams",
      "samagam.*types"
    ],
    "hi_patterns": [
      "विभिन्न.*समागम",
      "समागम.*परिभाषित",
      "निरंकारी.*समागम.*नाम",
      "समागम.*प्रकार"
    ],
    "en_answer": "Annual Sant Samagam, Bhakti Parv Samagam, Manav Ekta Diwas, Samarpan Diwas, Mukti Parv & Regional Samagams.",
    "hi_answer": "वार्षिक संत समागम, भक्ति पर्व समागम, मानव एकता दिवस, समर्पण दिवस, मुक्ति पर्व और क्षेत्रीय समागम।"
  },
  {
    "id": 29,
    "en_patterns": [
      "tell.*about.*annual.*sant.*samagam",
      "what.*is.*annual.*sant.*samagam",
      "describe.*annual.*sant.*samagam",
      "annual.*sant.*samagam.*details"
    ],
    "hi_patterns": [
      "वार्षिक.*संत.*समागम.*बताएं",
      "वार्षिक.*संत.*समागम.*क्या.*है",
      "वार्षिक.*संत.*समागम.*वर्णन",
      "वार्षिक.*संत.*समागम.*जानकारी"
    ],
    "en_answer": "Having started in 1948 under the divine aegis of Shahenshah Baba Avtar Singh Ji, the Annual Nirankari Sant Samagam is a large festival of love and oneness, witnessing nearly a million devotees worldwide. It features spiritual congregations, sewa activities, cultural programs, free community kitchens, medical help, exhibitions, and more, making it a vibrant celebration of brotherhood.",
    "hi_answer": "शाहेंशाह बाबा अवतार सिंह जी के दिव्य संरक्षण में 1948 में शुरू हुआ वार्षिक निरंकारी संत समागम प्रेम और एकता का बड़ा पर्व है, जिसमें विश्वभर से लगभग एक मिलियन भक्त सम्मिलित होते हैं। इसमें आध्यात्मिक सभाएँ, सेवा गतिविधियाँ, सांस्कृतिक कार्यक्रम, नि:शुल्क भोजनालय, चिकित्सा सहायता, प्रदर्शनी आदि शामिल होते हैं, जो भाईचारे का जीवंत उत्सव बनाते हैं।"
  },
  {
    "id": 30,
    "en_patterns": [
      "what.*is.*bhakti.*parv.*samagam",
      "define.*bhakti.*parv",
      "when.*bhakti.*parv.*celebrated",
      "describe.*bhakti.*parv.*samagam"
    ],
    "hi_patterns": [
      "भक्ति.*पर्व.*समागम.*क्या.*है",
      "भक्ति.*पर्व.*परिभाषित",
      "भक्ति.*पर्व.*कब.*मनाया.*जाता.*है",
      "भक्ति.*पर्व.*समागम.*वर्णन"
    ],
    "en_answer": "The Bhakti Parv Samagam is celebrated in the second week of January every year in various branches of the Mission worldwide, with the major congregation held near the Sarovar Complex in New Delhi. It celebrates loving devotion through speeches, poems, and songs, emphasizing gratitude towards formless God Nirankar and the grace of Satguru.",
    "hi_answer": "भक्ति पर्व समागम हर वर्ष जनवरी के दूसरे सप्ताह में मिशन की विभिन्न शाखाओं में मनाया जाता है, मुख्य समागम नई दिल्ली के सरोवर परिसर के निकट होता है। यह भाषणों, कविताओं और गीतों के माध्यम से प्रेमपूर्ण भक्ति का उत्सव है, जो निराकार ईश्वर निरंकार और सतगुरु की कृपा के प्रति कृतज्ञता को दर्शाता है।"
  },
  {
    "id": 31,
    "en_patterns": [
      "what.*is.*manav.*ekta.*diwas",
      "when.*manav.*ekta.*diwas.*observed",
      "describe.*manav.*ekta.*diwas",
      "purpose.*manav.*ekta.*diwas"
    ],
    "hi_patterns": [
      "मानव.*एकता.*दिवस.*क्या.*है",
      "मानव.*एकता.*दिवस.*कब.*मनाया.*जाता.*है",
      "मानव.*एकता.*दिवस.*वर्णन",
      "मानव.*एकता.*दिवस.*उद्देश्य"
    ],
    "en_answer": "Manav Ekta Diwas solemnly observes the sacrifice of Baba Gurbachan Singh Ji on 24th April. It promotes unity of humankind and includes large-scale blood donation drives and gatherings, inspiring followers with Baba Gurbachan Singh Ji's life and teachings.",
    "hi_answer": "मानव एकता दिवस 24 अप्रैल को बाबा गुरबचन सिंह जी के बलिदान को श्रद्धांजलि देता है। यह मानवता की एकता को बढ़ावा देता है और इसमें बड़े पैमाने पर रक्तदान शिविर और सम्मेलनों का आयोजन होता है, जो बाबा गुरबचन सिंह जी के जीवन और शिक्षाओं से अनुयायियों को प्रेरित करता है।"
  },
  {
    "id": 32,
    "en_patterns": [
      "what.*is.*samarpan.*diwas",
      "describe.*samarpan.*diwas",
      "when.*samarpan.*diwas.*observed"
    ],
    "hi_patterns": [
      "समर्पण.*दिवस.*क्या.*है",
      "समर्पण.*दिवस.*वर्णन",
      "समर्पण.*दिवस.*कब.*मनाया.*जाता.*है"
    ],
    "en_answer": "Samarpan Diwas, observed on 13th May, honors Baba Hardev Singh Ji Maharaj's life and teachings of love, forgiveness, and devotion. It also remembers Rev. Avneet Setya Ji, who passed away in the same incident as Baba Hardev Singh Ji.",
    "hi_answer": "समर्पण दिवस 13 मई को मनाया जाता है, जो बाबा हरदेव सिंह जी महाराज के प्रेम, क्षमा और भक्ति की शिक्षाओं और जीवन को सम्मानित करता है। यह रेव. अवनीत सेतिया जी को भी याद करता है, जिनका निधन बाबा हरदेव सिंह जी के साथ हुए उसी हादसे में हुआ था।"
  },
  {
    "id": 33,
    "en_patterns": [
      "what.*is.*mukti.*parv.*diwas",
      "describe.*mukti.*parv",
      "when.*mukti.*parv.*observed"
    ],
    "hi_patterns": [
      "मुक्ति.*पर्व.*दिवस.*क्या.*है",
      "मुक्ति.*पर्व.*वर्णन",
      "मुक्ति.*पर्व.*कब.*मनाया.*जाता.*है"
    ],
    "en_answer": "Mukti Parv Diwas, observed on 15th August, signifies the ultimate aim of salvation and soul's merger with the oversoul. It coincides with India's Independence Day and honors saints and leaders of the Mission, reinforcing unity and remembrance across all branches.",
    "hi_answer": "मुक्ति पर्व दिवस 15 अगस्त को मनाया जाता है, जो मुक्ति के परम लक्ष्य और आत्मा के परमा आत्मा में विलय का प्रतीक है। यह भारत के स्वतंत्रता दिवस के साथ मेल खाता है और मिशन के संतों व नेताओं को सम्मानित करता है, सभी शाखाओं में एकता और स्मरण को मजबूत करता है।"
  },
  {
    "id": 34,
    "en_patterns": [
      "what.*is.*regional.*samagam",
      "describe.*regional.*samagams",
      "where.*regional.*samagams.*held"
    ],
    "hi_patterns": [
      "क्षेत्रीय.*समागम.*क्या.*हैं",
      "क्षेत्रीय.*समागमों.*वर्णन",
      "क्षेत्रीय.*समागम.*कहां.*होते.*हैं"
    ],
    "en_answer": "Regional Samagams are spiritual congregations held throughout the year in various Indian states like Maharashtra, UP, Bihar, Rajasthan, West Bengal, Telangana, Gujarat, Punjab, Himachal Pradesh, and Madhya Pradesh. They promote the spirit of oneness and togetherness among diverse devotees.",
    "hi_answer": "क्षेत्रीय समागम पूरे वर्ष विभिन्न भारतीय राज्यों जैसे महाराष्ट्र, उत्तर प्रदेश, बिहार, राजस्थान, पश्चिम बंगाल, तेलंगाना, गुजरात, पंजाब, हिमाचल प्रदेश और मध्य प्रदेश में आयोजित किए जाते हैं। ये विभिन्न भक्तों के बीच एकता और एकजुटता की भावना को बढ़ावा देते हैं।"
  }
]